[{"title":"","desc":"","full_desc":""},{"title":"Hiroshi Mikitani","desc":"Founder, Chairman and CEO of Rakuten","full_desc":"Hiroshi “Mickey” Mikitani is the founder, chairman and CEO of Rakuten, one of the world’s largest Internet companies. In 1997 with just a handful of employees, he launched the Rakuten marketplace. Rakuten has expanded beyond e-commerce to encompass a dynamic global ecosystem of 55 different Internet services companies as diverse as travel, banking, credit card, eReading, and professional sports. The firm has operations in 28 countries and customers all over the world with a market cap of over $17 billion.\n"},{"title":"Sami Inkinen","desc":"Co-founder and board member of Trulia","full_desc":"Sami Inkinen, born and raised in Finland, is a serial technology entrepreneur, investor, data geek and recreational athlete during his limited spare time. Recently Sami was the President and Co-Founder of the online real estate marketplace Trulia that went public in 2012 and is currently pending a $3.5Billion acquisition. Sami serves on the board of three tech companies, mentors and advises other technology entrepreneurs – especially those focused on improving human health and performance. Sami is also a 6-time Hawaii Ironman triathlon finisher and triathlon world champion in his age group. His most recent summer vacation included an unsupported 4400km record breaking row across the Pacific Ocean from California to Hawaii with his wife.\n"},{"title":"Taizo Son","desc":"CEO at Movida Japan, Founder and Chairman at GungHo","full_desc":"Taizo Son has worked fervently for the past 15 years to start new IT-related venture companies. In 2002 he founded GungHo, one of Japan’s most successful online gaming companies. Their flagship game Puzzle & Dragons is the world’s top grossing app for iOS and Android, making more than $100M in monthly revenues. With Movida Japan, a seed accelerator he founded in 2009, the aim is to significantly boost the venture ecosystem in East Asia by 2030. He also serves as an Advisor at SoftBank, a Japanese Telecom and IT conglomerate with more than 1300 subsidiaries and affiliates worldwide, founded and led by his brother Masayoshi Son.\n"},{"title":"Ilkka Paananen","desc":"Co-founder and CEO of Supercell","full_desc":"Ilkka Paananen is the CEO and co-founder of Supercell, the Helsinki-based mobile games developer behind Clash of Clans and Hay Day. In October 2013 Japanese companies Softbank and GungHo acquired 51 % of the company for a reported $1.5 billion. IIkka has been an entrepreneur in the games industry since 2000. Prior to Supercell, he was the CEO & co-founder of Sumea, which was later acquired by Digital Chocolate, where he worked as a President until 2010. In addition to his role at Supercell, Ilkka helps other entrepreneurs as a partner in Lifeline Ventures, an early stage investor. Ilkka is also an active member of the Helsinki-based startup community where he mentors and coaches other founders. In addition to games and entrepreneurship, Ilkka is passionate about ice hockey. Ilkka’s favorite games include old classics like Civilization and Command & Conquer.\n"},{"title":"Martin Lorentzon","desc":"Co-Founder of Tradedoubler, Co-Founder and Chairman of Spotify","full_desc":"Martin Lorentzon is the Co-Founder and Chairman of Spotify and Co-Founder of TradeDoubler. Martin first struck up his partnership with Daniel Ek when Tradedoubler, Europe’s largest affiliate sales network, acquired Daniel’s company Advertigo in 2006. As chairman of Spotify, Martin has been on the company’s board of directors since July 2006. His responsibilities include creating and implementing strategy, budgets and goals. Previously, Martin held senior roles at Telia, Altavista, Cell Ventures and NetStrategy. He is currently also on the TeliaSonera board.\n"},{"title":"Mikkel Svane","desc":"Founder and CEO of Zendesk","full_desc":"Mikkel Svane is the Founder and CEO of Zendesk, a software development company that was valued at $631 million in the IPO in May 2015. Mikkel has served as Chief Executive Officer since August 2007 and as a member of the board of directors since August 2007. He was appointed Chair of the board of directors in January 2014. Prior to founding Zendesk, Mikkel founded and served as the Chief Executive Officer of Caput A/S, a software company, and served as a technology consultant. He holds an A.P. in marketing management from Arhus Kobmandsskole. Mikkel is the author, along with Carlye Adler, of the book “Startupland” to be published by Jossey-Bass in December 2014.\n"},{"title":"JP Rangaswami","desc":"Chief Scientist at Salesforce.com","full_desc":"JP Rangaswami is Chief Scientist at salesforce.com, a global cloud-computing company and CRM provider listed in the NYSE. As Chief Scientist, Rangaswami focuses on helping salesforce.com’s European customers think about innovative ways to use the real-time, mobile and social capabilities provided by Salesforce apps and the Force.com platform.\nOriginally an economist and financial journalist, he has spent the last 33 years working in information technology, primarily in the financial sector. He was named CIO of the Year by Waters Magazine in 2003, CIO Innovator of the Year by the European Technology Forum in 2004, European Innovator of the Year by Innovate in 2005; in 2007 and 2008, he was listed in Silicon.com’s Agenda Setters as one of technology’s 50 most influential people; in 2009 and 2010, he made the Wired 100 and was ranked 18th in 2010. More recently, he was ranked 4th in Computer Weekly’s 2013 list of the most influential people in IT.\n"},{"title":"Yuval Samet","desc":"Chief Product Officer at Klarna","full_desc":"Yuval Samet serves as the Chief Product Officer at Klarna, a company that provides e-commerce solutions for merchants and has raised $280 million of funding. At Klarna Yuval leads a group of 25 Product Managers and Product Designers, who are busy reinventing the way people buy online by fixing broken checkout experiences. In his role, he is responsible for the company’s vision execution, building the company’s product culture and discovery process and jointly deliver high quality software with Klarna’s engineering organization to attain the company’s business goals.\n"},{"title":"Sue Gardner","desc":"Journalist & Former Executive Director of Wikimedia","full_desc":"Sue Gardner is a journalist and the former Executive Director of Wikimedia Foundation, who scaled Wikipedia’s revenues from $2MM to $60MM, doubled its readership and tripled its article count, making Wikipedia the fastest-growing non-profit in the US.\nSue has been described as the Mother Teresa of the Internet, a “librarian to the world,” and “the ultimate media game-changer.” Her work is motivated by the desire to ensure that everybody in the world has access to the information they want and need so they’re equipped to make good decisions about their lives. She used to do that directly, as a journalist: now she does it through and with others, by movement-building and organization-building.\n"},{"title":"Matti Alahuhta","desc":"Chairman of DevCo Partners, former President and CEO of Kone","full_desc":"Matti Alahuhta was the President and CEO of KONE Corporation from 2005 to 2014. Prior to KONE he spent 26 years at Nokia, where he was a member of the Group Executive Board for the last 12 years. He is currently on the boards of several companies and organizations. He is Chairman at DevCo Partners, at Outotec and at Aalto University Foundation and Vice Chairman at the Confederation of Finnish Industries and a Member of the Board at KONE, UPM, ABB and Volvo AB. His passion for strategy and leadership development led 1990 to a doctoral dissertation on “Global growth strategies for high technology challengers”.\n"},{"title":"Alan Mamedi","desc":"Co-founder and CEO of Truecaller","full_desc":"Do you ever get a call from an unknown number and you wished you knew who it was? Alan Mamedi is the Co-founder of the award-winning app Truecaller, the world’s largest verified mobile phone community. Truecaller has an extensive crowdsourced database of public, mobile, and even prepaid phone numbers. The app empowers users to block spam callers, identify incoming calls from businesses and individuals, and search for contact info and names of callers. Alan has overseen Truecaller’s incredible growth in the past year, coming from 19 million in June 2013 up to 85 million now. In April 2014 Truecaller raised $18.8 million in funding led by Sequoia Capital, followed by $60 million in October 2014 from Atomico, Kleiner Perkins Caufield & Byers and Sequoia Capital.\n"},{"title":"Linda Liukas","desc":"Founder of RailsGirls and Hello Ruby","full_desc":"Linda is a programmer, storyteller and illustrator from Helsinki, Finland. Her proposed children’s book, Hello Ruby, is the most funded book on Kickstarter’s children’s book category with 380 000$ funding in total.\nLinda is a central figure in the world of programming and has worked on edutech already before it was called that. Linda is the founder of Rails Girls, a global phenomenon teaching the basics of programming for young women all over the world. She has previously worked at Codecademy, a programming education company in New York with over 5 million users all over the world.\nFurther, she believes that code is the 21st century literacy and the need for people to speak the ABC of Programming is imminent. She believes our world is increasingly run by software and we need more diversity in the people who are building it.\n"},{"title":"Chase Adam","desc":"Founder of Watsi","full_desc":"Before the age of 21, Chase traveled, worked, and studied in more than 20 countries around the world. He spent time in private sector intelligence in Washington, launched a national health program in Haiti, served in the Peace Corps in Costa Rica, and rode a motorcycle across Indonesia. In 2012 he founded Watsi, a nonprofit healthcare crowdsourcing platform, which enables individual donors to directly fund medical care for individuals in developing countries without access to affordable medical care. Today over 2000 treatments have been funded on their platform.\n"},{"title":"Jens Begemann","desc":"Co-founder and CEO of Wooga","full_desc":"Jens founded Wooga in 2009. With around 50M active players per month, Wooga is one of the most popular mobile game developers in the world. Jens is enthusiastic about people, play and technology. Guiding a team of talented people to develop quality games fulfills one of his lifelong ambitions. Before creating Wooga, Jens was the Chief Product Officer & Member of the Management Board at Jamba (Jamster), where he aided the company in becoming a world leader in mobile entertainment products.\n"},{"title":"Leland Melvin","desc":"Retired Astronaut and Head of Education at NASA","full_desc":"Leland is a retired American NASA astronaut and engineer. He flew two missions on the Space Shuttle Atlantis. After hanging up his space boots as the head of NASA Education he has served the White House. Leland was the United States representative and chair of the International Space Education Board (ISEB). After 24 years with NASA as a researcher, astronaut and Senior Executive Service leader he looks to share his stories of perseverance, and excellence to inspire communities for lasting positive change.\n"},{"title":"Esa-Pekka Salonen","desc":"Principal Conductor of London Philharmonia Orchestra","full_desc":"A lauded composer and world-renowned conductor, Esa-Pekka Salonen has a restless innovation that marks him as one of the most important artists in classical music. Salonen is currently the Principal Conductor and Artistic Advisor of the Philharmonia Orchestra and Conductor Laureate for the Los Angeles Philharmonic, where he was Music Director from 1992 until 2009. The 2014-2015 season will find him as the first-ever Creative Chair at the Tonhalle Zurich Orchestra, which has commissioned a new piece for orchestra and chorus from him and will perform nine other Salonen pieces throughout the season.\nEsa-Pekka is also one of the great minds behind the Orchestra, an extraordinary app that allows real-time selection of multiple video and audio tracks, along with an automatically synchronised score and dynamic graphical note-by-note visualisation of each piece as it is played. The result is an immersive environment for exploring the music and all the instruments of the orchestra.\n"},{"title":"Mikko Hyppönen","desc":"Chief Research Officer at F-Secure","full_desc":"Mikko Hyppönen is Chief Research Officer at F-Secure Corporation in Finland. He has led his team through the largest computer virus outbreaks in history. He named the infamous Storm Worm, was part of the Conficker Working Group and he has done classified briefings on the Stuxnet worm, a hugely complex worm designed to sabotage Iranian nuclear enrichment facilities.\nHe has written for magazines such as Scientific American, Wired and Foreign Policy and for newspapers like The New York Times. In addition to the most important security-related conferences worldwide Mr. Hypponen has addressed SXSW, DLD, Google Zeitgeist, the EU Parliament and TED conference. He was selected among the 50 most important people on the web by the PC World magazine and was included in the FP Global 100 Thinkers list. He also received the Virus Bulletin Award as the “Best educator in industry”.\n"},{"title":"Peter Levin","desc":"President of Interactive Ventures and Games at Lionsgate","full_desc":"Peter Y. Levin is the President of Interactive Ventures and Games at Lionsgate, the leading independent producer and distributor of motion pictures, television programming, entertainment, video-on-demand and digitally delivered content. Prior to his current position, Levin served as CEO and Co-Founder of Nerdist Industries, a multi-platform creator of genre and popular-culture content. He also served as Co-President of Legendary Entertainment Digital after Legendary Entertainment acquired Nerdist Industries in July of 2012. Prior to Nerdist Industries, Levin served as President and Co-Founder of Intel Capital, Dentsu, Softbank and DoCoMo-backed Bellrock Media Inc., a mobile and broadband entertainment company creating and distributing premium content for mobile and broadband platforms throughout North America and Japan.\n"},{"title":"Brad Hargreaves","desc":"Co-Founder of General Assembly","full_desc":"Brad co-founded General Assembly and is largely focused on guiding General Assembly’s strategic growth. GA is a global educational institution that is building a community of individuals, and has $50 million of funding raised. From developing the initial business models down to the day-to-day operational execution, Brad has played a key role in General Assembly’s expansion to more than eight global markets in less than two years. Today, Brad is focused on directing the organization’s digital efforts, including the development of its online educational products which will help expand General Assembly’s reach and bring high-quality online education to millions. Most recently, Brad was named to Vanity Fair’s “The Next Establishment”, Inc Magazine’s “30 Under 30”, and Business Insider’s “Silicon Alley 100”.\n"},{"title":"Nicholas Haan","desc":"Director of Global Grand Challengers at Singularity University","full_desc":"Nick is currently Director of Global Grand Challenges at Singularity University. Nicholas Haan has worked at the intersection of science, technology, social challenges, and innovation for the last 25 years. His issues of focus have included disaster relief, food security, environment, energy, public health, education, genetics, and information systems. And his affiliations have included the United Nations, governments, universities, donor agencies and non-governmental organizations.\nNick is also involved with several start-ups, including as strategic advisor to a mobile app company called eMobilis. He has a keen interest in the crowdsourcing movement and is on the regional board of directors for crowdfunder.com. He has been a visiting professor at University of Dar es Salaam, Tanzania; and was awarded a NASA Research Fellowship.\n"},{"title":"Christian Macht","desc":"CEO of Rakuten Deutschland","full_desc":"Dr. Christian Macht joined Rakuten Deutschland as CEO in November 2013, sending a clear signal to take a leading position as a fully integrated ecosystem of online-services in Europe’s biggest economic area. He also took over responsibility for the European sales and operations of Rakuten from July 2014.\n"},{"title":"Nadya Peek","desc":"Researcher at MIT Center for Bits and Atoms","full_desc":"Nadya Peek is a machine builder and PhD candidate at the MIT Center for Bits and Atoms, working on digital fabrication, technology for humans, and making machines that make. Nadya builds tools and automation systems for low-volume production and prototyping, with the aim to lower the threshold for building machines. Current projects include distributed control systems, foldable multipurpose fabrication tools, and reconfigurable machine construction sets.\n"},{"title":"Nicolas Brusson","desc":"Co-founder and COO of BlaBlaCar","full_desc":"Nicolas is the co-founder & COO of BlaBlaCar, a transport network that allows people travelling in the same direction or destination to share a vehicle. He leads the company’s international growth and operations. Naturally pragmatic, he uses fast iteration to uncover high-growth opportunities. Nicolas is a strong advocate of local teams and acqui-hire, a strategy he implemented to expand BlaBlaCar’s footprint to a global scale. He also led BlaBlaCar’s $100m financing in July 2014. Nicolas started his career working for start-ups in Silicon Valley during the 2000 boom, moved on to executive and investor roles, and finally worked as a Venture Capitalist in London, before leading BlaBlaCar’s global expansion.\n"},{"title":"Nils Hammar","desc":"CEO of Saltside Technologies","full_desc":"Nils Hammar is the founding CEO of Saltside, a company with a mission to create the largest, fastest and safest online marketplace for people in emerging markets, so that everyone can make great deals – for everything from cars and mobile phones to land and livestock. Their central belief is that access to an efficient marketplace improves people’s lives. The company has raised $25 million of funding in June 2014.\nNils has 10 years of experience from fast growing international online businesses. He started his career in 2004 as one of the first employees at Skype, managing marketing and product management teams in Europe and the US. In 2007 he co-founded Kindo.com, a social network for the family, which was later acquired by top genealogy site Myheritage.com.\n"},{"title":"Willow Mellbratt","desc":"Game Designer at Toca Boca","full_desc":"Willow Mellbratt is a play designer at Toca Boca, the game studio devoted to bringing fun, creative and gender neutral digital toys to kids all over the world. Willow is going to talk about how to desing digital toys and child-friendly applications for tablets and smartphones. Willow has a Masters in Experience Design from Konstfack in Stockholm and has her background in digital play. While working at Penguin Books and IDEO she fell in love with roleplaying. Together with BRIO she has worked on a project entitled “Future of play”. At Toca Boca she now strives to bring play into every step of the design process.\n"},{"title":"Joel Roos","desc":"EVP Products of Hem","full_desc":"Joel founded Hem (earlier One Nordic Furniture Company) in 2012, steering the company from launch to exit in two and a half years. One Nordic was sold to Fab Inc. in 2014 in one of the largest deals ever made in the Finnish design sector. Joel currently works as the Executive Vice President of Products for Hem, a global design company with 200+ employees focusing on E-commerce sales of design furniture and accessories, and is an angel investor funding Nordic start-ups. On his free time Joel is an avid CrossFitter and runner, currently clocking 38 minutes for 10K.\n"},{"title":"Carl Waldekranz","desc":"CEO and Co-founder of Tictail","full_desc":"Carl Waldekranz, 28 years old, is the CEO and co-founder of Tictail. With the vision to build the worlds most used and loved e-commerce platform, Tictail has become the home to more than 50,000 online stores since its launch 2 years ago. The first store on the platform was Carl’s own mother, By Mutti, who is now accompanied by global brands like Cheap Monday and Lufthansa, and independent brands such as Transparent Speaker and Deadwood. Before Tictail, Carl co-founded and sold a digital agency called Super Strikers, as well as founded Keyflow, a mobile guest list app company. Carl’s previous work includes development of the Spotify, Wrapp and Bambuser brand identity.\n"},{"title":"Hilmar Veigar Pétursson","desc":"CEO of CCP Games","full_desc":"Hilmar has been leading CCP Games’ ongoing success and growth since his appointment as Chief Executive Officer in 2004. Under Hilmar’s management CCP’s critically acclaimed science-fiction game EVE Online is celebrating an unprecedented tenth consecutive year of subscriber growth. The Company released its second title, DUST 514, a free-to-play, massively multiplayer first-person shooter for the PlayStation®3 in 2013 and is also developing EVE: Valkyrie, a multiplayer spaceship dogfighting shooter set in the EVE Universe. In addition, Hilmar has overseen the expansion of CCP operations to Shanghai, China as well as the strategic merger with Atlanta-based White Wolf Publishing in 2006,\nBefore his appointment to the CEO position, Hilmar held the title of CCP’s CTO, heading the engineering effort required to create CCP’s persistent world technology and 3D engine. Prior to joining CCP in 2000, he served as the CTO of SmartVR, an OZ.com spin-off based on that company’s multi-user virtual reality technology following his tenure as the VP of software development for the OZ Studios division of OZ.com.\n"},{"title":"Bob Slinn","desc":"Head of Gaming Partnerships for EMEA at Facebook","full_desc":"Bob Slinn is Head of Gaming Partnerships for EMEA at Facebook in London, United Kingdom. He is currently managing the EMEA gaming partners, as well as recruiting new developers for the Facebook platform, with a focus on supporting larger cross-platform partners across the region. Prior to Facebook, Bob held various roles at EA (Electronic Arts) in California, including Senior Director of Publishing. Bob was also previously Director of Media Operations at Yahoo,  where he led strategy and operations for all Yahoo!’s Media products in Europe. Bob holds a BA from University of Western Ontario in French Literature and History as well an MBA from York University in Toronto. Bob also speaks fluent French.\n"},{"title":"Linda Raftree","desc":"Co-founder of Technology Salon & Kurante","full_desc":"Linda Raftree has worked at the intersection of community development, participatory media, and information and communication technologies (ICT) since 1994, including 16 years working with Plan International. She recently co-founded Kurante, which supports organizations to better understand technology’s role in development programs and to implement strategic, high impact efforts that integrate innovative approaches and tools. Linda currently serves as a Special Advisor to the Rockefeller Foundation’s Evaluation Office on the use of ICTs for monitoring and evaluating social impact. She has conducted research on adolescent girls and ICTs for UNICEF, ICTs and child/youth migration for the Oak Foundation, and mobile technologies in youth workforce development for the mEducation Alliance. Linda coordinates Technology Salons in New York City and she advocates for greater dialogue and discussion around the ethical use of ICTs and data privacy in the humanitarian and development space. She writes ‘Wait… What?’ a blog about new technology and community development, and tweets at @meowtree.\n"},{"title":"Walter Bender","desc":"Co-founder of One Laptop Per Child","full_desc":"Walter Bender is a co-founder of “One Laptop Per Child” (OLPC), an association developing a low-cost, connected laptop with technology and contents to empower learning. He is also the founder of Sugar Labs, a foundation supporting the community of educators and software developers using Sugar open-source environment (as a part of OLPC’s development). Between 2000 and 2006, he served as director of MIT Media Lab. Bender holds a BA from Harvard University and M.Sc from MIT\n"},{"title":" Uli Weinberg","desc":"Director of D-School, Hasso Plattner Institute","full_desc":"Uli Weinberg is the Director of the School for Design Thinking and the Hasso Platter Institute. He’s going to share his stories about how we can make systemic change through enabling collaborative creativity.\n"},{"title":"Doreen Kessy","desc":"COO at Ubongo","full_desc":"Doreen Kessy is a business management professional passionate about bringing forth social change through edtech in Africa. She is a COO at Ubongo, a Tanzanian based social enterprise that creates interactive edutainment for learners in Africa, delivered to them via the technologies they already have.\nDoreen has also worked at various organizations including International Justice Mission, Wells Fargo and Smile for Africa. She has an MBA and a B.S in International Business and Economics from Liberty University in Virginia. She also does the English voice of Ngedere on Ubongo’s interactive edu-cartooon known as Ubongo Kids.\n"},{"title":"Markku Mäkeläinen","desc":"Director, Global Operator Partnerships, Facebook Inc.","full_desc":"Markku Makelainen is responsible for Global Operator Partnerships at Facebook. Prior to Facebook’s acquisition of Pryte.com, Markku served as CEO and Founder. Before Pryte, Markku spent fifteen years working with different mobile internet growth companies mainly focusing on developing mobile data markets. Markku has an MSc from the University of Technology in Helsinki.\n"},{"title":"Jessica Colaco","desc":"Director of Partnerships, iHub","full_desc":"Jessica Colaço is currently the Director of Partnerships at iHub. She was the Founding Manager between 2010 and 2011 at iHub and Research Director between 2011 and 2013 at iHub Research. She is passionate about Innovation, Research, Mobile and Robotics Technology, Mentorship and Entrepreneurship in Kenya as she uses her position at iHub to court local, regional and international stakeholders to adopt Kenyan-made and African-made solutions. As an upcoming angel investor, she courts local and international investors to invest in great tech ideas and companies at idea and concept stage. She is also a Mobile and Robotics Tech Evangelist, Co-Founder of WMIAfrica and AkiraChix, ISOC-Kenya Chapter, Treasurer, ACM-W Nairobi Chapter Chair, TED Global Fellow 2009 and upcoming Guitarist. She was named one of the top 40 women under 40 years in Kenya’s business scene by Business Daily on 2009, 2011 and 2012.\n"},{"title":"Tanya Accone","desc":"Senior Advisor on Innovation, UNICEF","full_desc":"Tanya Accone’s career has focused on helping international public and private sector organizations amplify their impact through the convergence of innovation, communication and technology. Her focus is on applying innovation for social impact and as a public good. Accone characterizes her role as “standing at the intersection where the rubber of ideas, meets the road of reality, trying to organize vehicles for the world’s most marginalized children so they too have the information, opportunity and choice to be empowered drivers of their own destiny.”\n"},{"title":"Vineet Bewtra","desc":"Director, Investments, Omidyar Network","full_desc":"Vineet leads Omidyar Network’s impact investing strategy in and from Europe. He is also responsible for leading Omidyar Network’s education-related investments across Africa as well as globally applicable platforms coming out of Europe. Vineet joined Omidyar Network in mid-2011, before which he spent three years as an investment manager at The Children’s Investment Fund Foundation. He spearheaded the foundation’s work in educational achievement, concentrating on Sub-Saharan Africa and India. His work included leading an innovative remedial education program with the Government of Ghana aimed at improving the literacy and numeracy of primary schoolchildren, developing the foundation’s straregy around early childhood education, and creating school-based deworming programs. Previously, Vineet worked for 14 years in Europe’s structured and illiquid fixed income markets. He served as managing director at Dresdner Kleinwort, running a proprietary investment desk and participating on the firm’s underwriting committee. Vineet also worked at Lehman Brothers, Deutsche Bank, and Chemical. Vineet received a BA with honors from Cambridge University and an MSc in development management from the London School of Economics.\n"},{"title":"René Parker","desc":"CEO of RLabs","full_desc":"René Parker is the CEO of RLabs a global social enterprise with a strong focus on Community-driven Innovation and Social Change operating in 22 countries serving more than 5 million people. René has been instrumental in the growth of RLabs in East Africa setting up its operations in Tanzania and founded the Women in ICT Faculty that currently serves thousands of women annually through digital skills. She also joined the board of the Living Labs in Southern Africa (LLiSA) network where she fulfills the portfolio of Capacity Building and Community Development and a key member of the AfriLabs network. René also co-founded the award winning technology media start-up “She’s The Geek” that provide training and consulting where she had the privileged of working with global brands. She is a sought after speaker and thought leader who provides a variety of consulting services in International Development and Community Innovation to both private and public sector. She also serves in an advisory capacity to a number of international universities. Four things her RLabs team in Cape Town say about her: passionate, kind, motivated and patient.\n"},{"title":"Henrik Storm Dyrssen","desc":"CEO, Leksell Social Ventures","full_desc":"Henrik is the CEO of Leksell Social Ventures, initiated with Swedish med-tech billionaire Laurent Leksell and family. LSV is the first professional investment company for social innovation in Sweden. Henrik has a background in international relations in the Middle East, East African micro finance and global investment banking in London.\n"},{"title":"Michael Staton","desc":"Partner at Learn Capital","full_desc":"Michael Staton is a Partner at Learn Capital, where he has helped lead investments into Coursera, CreativeLIVE, Kalibrr, BrightBytes, and MakersRow. Prior to joining LearnCapital, for five years he advised and worked with industry leading companies, such as Dev Bootcamp, Quizlet, and Goalbook. He is the founder and former CEO of Uversity, the pioneer of Social Enrollment Management technology in Higher Education. Michael serves as a Venture Partner and Community Advisor to NewSchools Venture Fund’s Seed Fund, and began his career as a classroom teacher. Michael was declared a top one hundred innovator by the Chronicle of Higher Education, and he is on the advisory board of SXSWedu and the Higher Education Working Group of the American Enterprise Institute.\n"},{"title":"Srini Swaminathan","desc":"Alumnus of Tech for India","full_desc":""},{"title":"Sanna Lukander","desc":"VP of Learning at Rovio","full_desc":""},{"title":"John Martin","desc":"CEO of Sanoma Learning","full_desc":"John Martin is CEO of Sanoma Learning.  Sanoma serves about 10 m pupils and 1 m teachers with learning solutions and is a leading and integral partner in some of the World’s best performing education systems including Finland, The Netherlands, Belgium and Poland, as well as Sweden. Sanoma employs about 1600 learning professionals and is a frontrunner in the digital transformation, generating about € 50 m of annual pure-play digital and € 100 m multi-channel solution sales, making it one of continental Europe’s biggest K-12 edtech companies today.  Martin was previously responsible for Group Digital and Strategy at Sanoma.  He has a background in scientific publishing and holds a Ph.D. in molecular biology.\n"},{"title":"Caroline Walerud","desc":"Co-Founder and CEO of Volumental","full_desc":"Caroline Walerud, Co-founder and CEO of Volumental, is a serial entrepreneur with a degree in chemistry from Cambridge Univeristy who has already lead eight startups and organisations in their growth. In November 2012, she co-founded Volumental with three computer vision experts at KTH Royal Institute of Technology in Stockholm. Volumental is creating a platform for the future of product customization by making 3D scanning of people fast, easy and accurate using off-the-shelf consumer depth cameras and cloud software. In September 2014 Volumental announced a $3 Million seed investment and a partnership with Intel. Volumental is currently working on several POCs with leading companies in orthotics and fashion retail. Caroline topped 2013’s Supertalent list, the Swedish magazine Veckans Affärer’s top 101 Super-Talents under 40 and was ranked as one of Expressen’s Women of the Year in 2014.\n"},{"title":"Andreas Bernström","desc":"Founder and CEO of Sinch","full_desc":"Andreas Bernström is the founder & CEO of Sinch, a communications platform for mobile and web developers. The company employs 50 staff in Stockholm and San Francisco and manages around 100m transactions a month – Sinch is a spin off from Rebtel the global mVoIP giant that Andreas ran for almost 5 years. Andreas joined Rebtel in 2009 as CEO and grew revenues 5X to $100m and the user base to 25m globally. Andreas also holds the position of Industrial Advisor at EQT Partners the 22bn Euro Private Equity firm. Andreas started his career at Goldman Sachs, but after 3 years moved to TradeDoubler to become MD, where between 2002-2007 he grew revenues from $4m-110m. In 2007, Andreas was promoted to COO of TradeDoubler, leading 600+ employees generating $500 million in revenues operating in 19 territories. Andreas is also a regular writer for WSJ, Huffington Post, Venture Beat, TechCrunch and several other publications.\n"},{"title":"Karin Nilsdotter","desc":"Astropreneur, space traveller and community builder","full_desc":"Karin is Co-Founder and CEO of Space Travel Alliance and Managing Partner of Spaceport Sweden, two pioneering initiatives to realize the dream of commercial space travel; establishing Europe’s gateway to space in Swedish Lapland and a leading spaceline for tourism, research and education. The sky is not the limit as Karin seeks to launch not only spaceships but also new products, experiences and careers, inspiring and empowering talent and startups building a new industry. Passionate about innovation, Karin has led the development of a space tourism and training program, founded TEDxKiruna and initiated Creative Space; a do-tank for young talent across science, arts and tourism. Awarded for her pioneering work Karin has further been ranked as one of the leading women in Newspace for her drive to invigorate tourism locally, empower communities globally and advance Sweden as an aerospace innovation leader.\n"},{"title":"Clive Jackson","desc":"Founder and CEO of VICTOR","full_desc":"With a stable of companies and over twenty years’ experience in technology, aviation and media, Clive has now created VICTOR, a highly innovative company that is radically changing the private jet industry, making the use of private jets much more accessible and affordable. The idea was born when Clive became frustrated with the inconvenience involved in flying on budget airlines each time he visited his second home in Mallorca. From this frustration came the idea of creating an online community and trading platform to offer an alternative to the hassles of scheduled airline travel.\n"},{"title":"Roland Lamb","desc":"Founder and CEO of Roli","full_desc":"Roland Lamb is an award-winning designer and entrepreneur. At eighteen he moved to a monastery in Japan to practice Zen Buddhism, and then traveled extensively, working as a visual artist and jazz musician. A passion for cross-cultural thought brought him to Harvard, where he concentrated on Classical Chinese and Sanskrit philosophy, before studying in the Design Products department at the Royal College of Art.\nRoland is the founder and CEO of ROLI, and inventor of the Seaboard GRAND—a musical instrument that re-imagines the keyboard as a sensitive, soft three-dimensional surface that enables unprecedented intuitive manipulation of the fundamental characteristics of sound. He and his wife, the novelist Tahmima Anam, live in East London with their son, Rumi.\n"},{"title":"Paul Murphy","desc":"Co-Founder and CEO of Dots","full_desc":"Paul Murphy is the co-founder and CEO of Dots, a leading mobile gaming studio focused on the intersection of art and entertainment. Both the original Dots and this year’s TwoDots have been some of the biggest hits on the App Store, both in terms of downloads and monetization. Prior to Dots, Paul helped start and fund a handful of successful startups as a partner at betaworks, including Giphy, Bloglovin, and Rushmore. Prior to betaworks, helped lead Aviary’s (acquired by Adobe) pivot to a mobile photo editing platform as their COO, which ultimately led to Aviary’s acquisition by Adobe. Before Aviary, he was chief of staff for the President of Microsoft’s Business Division. Paul is an advisor, investor, and board member for a number of startups. He holds a Computer Engineering degree from Virginia Tech and an MBA from IE Business School in Madrid.\n"},{"title":"Daniel Kjellen","desc":"Co-Founder and CEO of Tink","full_desc":"Daniel Kjellén, CEO and co-founder of Tink, the personal finance app that makes it simple, smart and fun to see what you spend your money on. Daniel Kjellén and Fredrik Hedberg founded Tink in 2012 and in 2013 the Tink app was released to the Swedish market. In September Tink raised $4 USD in funding lead by Sunstone Capital for an international launch. Daniel has previously founded a domain sales company and been working for Carnegie Investment Bank. Now he wants to make personal finance much more engaging and personal.\n"},{"title":"Mattias Ljungman","desc":"Co-Founder of Atomic","full_desc":"Mattias launched Atomico in 2006 alongside Niklas Zennström, sourcing investments and building Atomico’s team of experts who help portfolio companies to scale globally. In that time, Mattias has been involved with exits or substantial transactions in companies including Supercell (sold a majority stake to SoftBank valuing the business at $3bn in 2013), The Climate Corporation (acquired by Monsanto for $1.1B in 2013), Xobni (acquired by Yahoo! in 2013) and Power Reviews (acquired by Bazaarvoice in 2012).\nMattias works closely with a number of portfolio companies on their expansion, including Supercell, Klarna, Hailo, 6Wunderkinder and Truecaller. He also leads the work of Atomico’s experienced global team on the ground in China, Japan, Brazil, Turkey and Korea, helping portfolio companies to scale into these major international markets. The team also helps founders with other skills that may not be native to them but which are critical to get right in a growing business, like talent and communications.\n"},{"title":"John Lindfors","desc":"Partner at Digital Sky Technologies","full_desc":"After graduating from the Swedish School of Economics in Helsinki in 1993, John joined Goldman Sachs in London as a Financial Analyst. After 17 years at the company in different positions, he ended up leading the European Technology and Media investment banking department from 2005 onwards as a Partner of Goldman Sachs.\nIn 2010, John left Goldman Sachs to join DST Global, which is a growth-focused investment fund targeting founder-led category leaders in the internet and tech space. In the last five years, DST Global has invested more than $4 billion in companies such as Facebook, Alibaba Group, JD.com, Xiaomi, Flipkart, Spotify, AirBnB, Lending Club and many others.\n"},{"title":"Steven Dietz","desc":"Partner at Upfront Ventures","full_desc":"Steven has been a Partner at Upfront since its founding in 1996. Upfront Ventures is a VC firm focusing on investments in early stage technology companies, with totals of $800 million. Prior to Upfront, Steven was a Senior Vice President of Donaldson, Lufkin and Jenrette in the Investment Banking Division. He was also a member of DLJ’s Retailing Group for 14 years, where he provided advisory and capital raising services to more than 30 different retailers and numerous information technology companies. Steven focuses on investments in early-stage companies in Financial Services and Technology, Consumer, SaaS, and Big Data.\n"},{"title":"Nikolaj Nyholm","desc":"Partner at Sunstone Capital","full_desc":"Nikolaj is a serial technology entrepreneur and investor. He has founded four pioneering technology startups and is now a partner at the Nordic-based early-stage venture capital investor, Sunstone Capital.\n"},{"title":"Alexander Galitsky","desc":"Co-founder and managing partner at Almaz Capital","full_desc":"Alexander Galitsky is a Co-Founder and Managing Partner of Almaz Capital Partners. Alexander is a well-known entrepreneur and investor in Russia/CIS, Europe and USA. Prior to Almaz, Alexander formed the ICT investment practice at Russian Technologies, one of the first venture capital funds in Russia and founded five successful high-tech companies. Before becoming an entrepreneur, Alexander served as one of the top technical executives for the Soviet space industry, where he worked on the MIR space station and the Soviet “Star Wars” response. Alexander has been honored numerous times as the most influential person in the Russian IT and Internet industry by Forbes. Alexander serves on the Skolkovo Foundation Board and as Chairman of the advisor committee for Russian Venture Company.\n"},{"title":"Alex Arias","desc":"Co-Founder and CEO of Omniata","full_desc":"Alex Arias is the CEO and co-founder of Omniata, a unified data and engagement platform.\nFor more than 10 years, Alex has been an entrepreneur and driver of innovation in digital services. In 2007 the platform he built to deliver mobile content to telecoms, was acquired by Digital Chocolate, where he spent the next 4 years leading the vision of CRM, e-commerce and BI solutions. He then continued at EA as a Director of Product Management, leading the vision for the global data and engagement platforms. It has been 2 years now since he has embarked on his own journey into data discover and is pleased to be present at Slush 2014 having gained many of the leading gaming companies as clients already.\n"},{"title":"Peter Griffith","desc":"Head Of Phones Design of Microsoft","full_desc":"Peter Griffith has been the Head of Phones Design in Microsoft since September 2014. He has led industrial design teams at Nokia for eight years, most recently the Mobile Phones Industrial Design. Together, these teams have designed some of Nokia’s best-selling devices such as Nokia 105, Nokia 206, as well as the Nokia Asha family and the Nokia X devices.\n"},{"title":"Pia Henrietta Kekäläinen","desc":"Founder of mehackit.org","full_desc":"Mehackit strives to have every child and youth experiment with technology in an open setting. Mehackit is launching a high school pilot as you’re reading this, and they’re excited to take on new pupils across Scandinavian schools in the near future. In her speech, she will tell you how every 15-year old can become an enthusiastic teacher of technology to the younger ones, and how design challenges can change learning.\nHenrietta graduated from Singularity University’s Graduate Summer Program 2013, aimed to combat humanity’s greatest challenges with exponential technologies. Previously, she helped scale out Rails Girls and has been building entrepreneurial communities in Vienna and Helsinki. Henrietta is also a World Economic Forum Global Shaper from the Helsinki Hub (and on a persistent mission to save the world).\n"},{"title":"Yaacov Hecht","desc":"Founder of Democratic School","full_desc":"Yaacov Hecht is an internationally distinguished leader and visionary in democratic education, learning theory, and societal change. He founded the Democratic School in Hadera, Israel, in 1987. It was the first school in the world to call itself democratic. Hecht’s aspiration is that the “pyramid classroom,” 30 students in front of a single teacher, will transform into a “learning social network,” comprised of 31 teachers and students – a network in which each student or teacher can teach his/her areas of strength and learn from the strengths of others. Hecht believes we are approaching a new groundbreaking educational solution – a transition from the schools of the industrial age to a “learning social network” – and its implementation, which he refers to as an “Education City.” Most recently, in 2010, Hecht co-founded “Education Cities-the Art of Collaborations,” an organization which focuses on turning educational systems into a central growth instrument for the cities in which they exist. Hecht continues to be a sought after speaker and consultant, and plays an essential role in the movement for democratic education in Israel and around the world.\n"},{"title":"Tim Vanderham","desc":"VP Cloud Platform Development of IBM","full_desc":"Tim Vanderham is the Vice President responsible for the world wide development, delivery, operations, and support of the IBM Platform as a Service and the development and integration of the IBM Cloud Marketplace. Tim was the Director of Development for PureApplication where he lead a worldwide team that created and delivered the technology to market.  Prior to that role, he held a number of management roles within the WebSphere development organization spanning support and services through development and delivery.  In all of his roles, he is very active in the technical and public community through giving keynotes at conferences and through his close work with clients worldwide.\n"},{"title":"Haig A. Peter","desc":"Cognitive Computing Ambassador at IBM Research","full_desc":"Haig A. Peter is a Cognitive Computing Ambassador at IBM Research – Zurich having joined the IBM Corporation in 2000. As an ambassador at IBM, Haig meets with hundreds of clients annually to help them understand how cognitive computing systems can learn and interact naturally with people to extend what either humans or machine could do on their own, particularly when it comes to making better decisions by penetrating the complexity of Big Data.\n"},{"title":"Tiina Zilliacus","desc":"Founder and CEO of Gajatri Studios","full_desc":"Tiina is the Founder and CEO of Gajatri Studios, a Helsinki-based mobile games studio that focuses on integrating authentic well-being content with fun mobile free-to-play games format. The company develops Yoga Retreat, the world’s first yoga themed mobile simulation game targeted at female gaming audience. During her 17 years career in mobile Tiina has ramped up and managed several b2c services both as start-up CEO and Nokia executive. Tiina is passionate yoga practitioner since 10 years and huge well-being enthusiast.\n"},{"title":"Teemu Huuhtanen","desc":"CEO of Next Games","full_desc":"Teemu Huuhtanen is the CEO of Next Games, the fresh Finnish mobile game studio founded in 2013. Teemu leads Next Games’ business development and is determined to build Next Games into a flourishing game company with its foundations strongly rooted in both internally developed and premium 3rd party IP games. Working in collaboration with AMC, they are currently developing a mobile game based on the blockbuster TV series The Walking Dead as well as a game based on their own intellectual property. With 15+ years of games business experience, his previous roles include business development with Rovio and Sulake, the makers of Habbo Hotel, as well as managing his own games company. Teemu is a firm believer in an open work culture and with the rest of the Next Games family, he shares a profound love for games and a burning desire to develop lasting global entertainment.\n"},{"title":"Tyler York","desc":"Co-Founder and Director of Business Development of Fuel Powered","full_desc":"Tyler’s ambitions in the game industry began at 12 when he was making custom maps for Starcraft: Brood War. As the Director of Business Development at Fuel, he helps game publishers make the most of their investments with multiplayer and live ops. Tyler began his startup career as a True Ventures’ TEC fellow, interning at SendMe Mobile, a mobile content company, and moonlighting for Lookout Mobile Security, the world’s leading mobile security company before joining Betable to lead developer and player marketing. Tyler graduated from Carnegie Mellon University with a BS in Marketing and a focus in Entrepreneurship.\n"},{"title":"Dan Brody","desc":"VP for Business Development at Tencent","full_desc":"Dan Brody is VP for Business Development at Tencent. As part of the Interactive Entertainment Group which has overall responsibility for Tencent’s gaming initiatives, Dan serves as the interface with companies based in western markets. Over half of Tencent’s revenue comes for games, and a significant portion of that is from internationally licensed games, so Dan’s division is responsible for bringing in the world’s best games to China’s largest group of gamers, as well as evaluating investment possibilities in Western markets. Previously, Dan served a variety of executive management roles with Spotify, Tudou, Google, Motorola, USITO, and several startups, as well as several years on the board of the American Chamber of Commerce in China. Dan has lived in China since graduating from Georgetown University SFS in 1996, and as a former interpreter is fluent in written and spoken Mandarin.\n"},{"title":"Piyush Shah","desc":"VP of Products at InMobi","full_desc":"Piyush Shah joined InMobi in October 2009 and currently serves as Vice President of Products. InMobi is a mobile-first platform allowing brands, developers and publishers to engage consumers through mobile advertisement by leveraging data and user behaviour. They have raised $215 million in funding. Piyush is responsible for the overall vision, strategy and execution for the InMobi product portfolio. Prior to taking on the role of VP of Products, Piyush was the Vice President and General Manager for Performance Advertising – helping customers to acquire quality users through app installs and lead generation offerings.Piyush brings to InMobi over 13 years of experience in entrepreneurship, strategy, business development, product management and operations.\n"},{"title":"Stephen Upstone","desc":"CEO and Co-Founder of LoopMe","full_desc":"Stephen started working in mobile advertising in 2006. He was Managing Director Europe for Ad Infuse (sold to Velti) and then VP Sales and Business Development Europe for Velti after the takeover. Stephen was part of the senior management team that successfully listed Velti on the NASDAQ and was present in New York for the ringing of the opening bell.\nWhilst at Ad Infuse & Velti, Stephen opened offices across the globe, helping to build a mulit-million dollar business, working with companies such as Vodafone, Orange, T Mobile, Sky and Daily Mail. Prior to Ad Infuse Stephen worked at Touch Clarity (sold to Omniture), FirstCapital, Universal McCann and Lowe Howard Spink.\nHe is Chairman of the MMA UK Advisory Board and member of the EMEA Board. Stephen was previously Co-Chair of the Global Advertising Committee and was a Member of the IAB Mobile Advertising Committee. With over 18 years’ experience in advertising and technology, Stephen is a practised commentator and speaker.\n"},{"title":"Sten Tamkivi","desc":"CEO of Teleport, Inc.","full_desc":"Sten is the CEO of Teleport, Inc, the search engine for digital nomads. Prior to co-founding Teleport he served at Skype as an early executive, riding the roller coaster for over 8 years from startup to the $8.5B exit to MSFT. Sten started his entrepreneurial career founding the first digital media agency in Estonia at the age of 18 and has stayed on the forefront of internet, user experience design and software development scene since 1996. Sten values a tolerant, open and creative society, speaks up for entrepreneurship, supports the startup movement, occasionally invests, pushes for better tech education and has advised President Ilves of Estonia on the above. He also holds a number of management and advisory board seats and blogs at sten.tamkivi.com.\n"},{"title":"Manish Agarwal","desc":"CEo of Reliance Internatio","full_desc":"Manish Agarwal is the CEO of Reliance Entertainment Digital where he oversees digital businesses which include gaming companies Zapak and Reliance Games, movie steaming service BigFlix and digital strategy and execution company World Wide Open! Over a 16-year career he has successfully been associated with some of the best brands and organizations — Unilever, Microsoft, Rediff, Infosys and UTV to name a few. Manish’s expertise spans across consumer psychology and translating it into products and leveraging digital marketing and developer ecosystems to create consumer centric scalable business from scratch. A self-confessed “intrapreneur” he has strong inclination to work with startups to keep his mind fertile for incubating new ideas which can change the way consumers live their life today. He is passionate towards bringing the product thinking which exists in India on global map and showcase world class products coming out from Indian companies. He is living his dream to see India on the world map of mobile gaming by creating immensely successful mobile games for a global audience.\n"}]