[{"title":"","desc":"","full_desc":"","speaks":"","type":"SPEAKER"},{"title":"Hiroshi Mikitani","desc":"Founder, Chairman and CEO of Rakuten","full_desc":"Hiroshi “Mickey” Mikitani is the founder, chairman and CEO of Rakuten, one of the world’s largest Internet companies. In 1997 with just a handful of employees, he launched the Rakuten marketplace. Rakuten has expanded beyond e-commerce to encompass a dynamic global ecosystem of 55 different Internet services companies as diverse as travel, banking, credit card, eReading, and professional sports. The firm has operations in 28 countries and customers all over the world with a market cap of over $17 billion.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tPanel Discussion with the Prime Ministers of Estonia and Finland, and founder CEO of Japan's ecommerce giant Rakuten\n    \t\t\t\t\t\t\t\tTuesday 10:40 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/04/mickey_rbg-e1409158857766.jpg","type":"SPEAKER"},{"title":"Sami Inkinen","desc":"Co-founder and board member of Trulia","full_desc":"Sami Inkinen, born and raised in Finland, is a serial technology entrepreneur, investor, data geek and recreational athlete during his limited spare time. Recently Sami was the President and Co-Founder of the online real estate marketplace Trulia that went public in 2012 and is currently pending a $3.5Billion acquisition. Sami serves on the board of three tech companies, mentors and advises other technology entrepreneurs – especially those focused on improving human health and performance. Sami is also a 6-time Hawaii Ironman triathlon finisher and triathlon world champion in his age group. His most recent summer vacation included an unsupported 4400km record breaking row across the Pacific Ocean from California to Hawaii with his wife.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tGet uncomfortable\n    \t\t\t\t\t\t\t\tWednesday 13:30 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Wellbeing and startup life – can you have both?\n    \t\t\t\t\t\t\t\tWednesday 15:05 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/sami-inkinen.jpg","type":"SPEAKER"},{"title":"Taizo Son","desc":"CEO at Movida Japan, Founder and Chairman at GungHo","full_desc":"Taizo Son has worked fervently for the past 15 years to start new IT-related venture companies. In 2002 he founded GungHo, one of Japan’s most successful online gaming companies. Their flagship game Puzzle & Dragons is the world’s top grossing app for iOS and Android, making more than $100M in monthly revenues. With Movida Japan, a seed accelerator he founded in 2009, the aim is to significantly boost the venture ecosystem in East Asia by 2030. He also serves as an Advisor at SoftBank, a Japanese Telecom and IT conglomerate with more than 1300 subsidiaries and affiliates worldwide, founded and led by his brother Masayoshi Son.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with CEO of Supercell and Chairman of GungHo: How to build a company in an unconventional way \n    \t\t\t\t\t\t\t\tTuesday 14:00 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2013/09/Taizo-Son_crop.gif","type":"SPEAKER"},{"title":"Wang Jian","desc":"CTO of Alibaba","full_desc":"Jian Wang has served as a chief technology officer at Alibaba since August 2012. Prior to his current position, he was our chief architect from the time he joined our company in September 2008. He also served as president of Alibaba Cloud Computing from its inception in September 2009 until September 2013.Before joining our company, he was assistant managing director at Microsoft Research Asia, where he had served since 1999. Prior to that, he worked at Zhejiang University in Hangzhou, China as a professor and head of the psychology department. Jian serves on the board of directors of CITIC 21. Jian holds a bachelor’s degree in psychology and a Ph.D in engineering from Hangzhou University.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with CTO of Alibaba Wang Jian\n    \t\t\t\t\t\t\t\tTuesday 10:21 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Wang_Jian.jpg","type":"SPEAKER"},{"title":"Ilkka Paananen","desc":"Co-founder and CEO of Supercell","full_desc":"Ilkka Paananen is the CEO and co-founder of Supercell, the Helsinki-based mobile games developer behind Clash of Clans and Hay Day. In October 2013 Japanese companies Softbank and GungHo acquired 51 % of the company for a reported $1.5 billion. IIkka has been an entrepreneur in the games industry since 2000. Prior to Supercell, he was the CEO & co-founder of Sumea, which was later acquired by Digital Chocolate, where he worked as a President until 2010. In addition to his role at Supercell, Ilkka helps other entrepreneurs as a partner in Lifeline Ventures, an early stage investor. Ilkka is also an active member of the Helsinki-based startup community where he mentors and coaches other founders. In addition to games and entrepreneurship, Ilkka is passionate about ice hockey. Ilkka’s favorite games include old classics like Civilization and Command & Conquer.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with CEO of Supercell and Chairman of GungHo: How to build a company in an unconventional way \n    \t\t\t\t\t\t\t\tTuesday 14:00 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Ilkka+Paananen_crop.gif","type":"SPEAKER"},{"title":"Martin Lorentzon","desc":"Co-Founder of Tradedoubler, Co-Founder and Chairman of Spotify","full_desc":"Martin Lorentzon is the Co-Founder and Chairman of Spotify and Co-Founder of TradeDoubler. Martin first struck up his partnership with Daniel Ek when Tradedoubler, Europe’s largest affiliate sales network, acquired Daniel’s company Advertigo in 2006. As chairman of Spotify, Martin has been on the company’s board of directors since July 2006. His responsibilities include creating and implementing strategy, budgets and goals. Previously, Martin held senior roles at Telia, Altavista, Cell Ventures and NetStrategy. He is currently also on the TeliaSonera board.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with the co-founder and chairman of Spotify\n    \t\t\t\t\t\t\t\tTuesday 13:00 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/spotify.jpg","type":"SPEAKER"},{"title":"Mikkel Svane","desc":"Founder and CEO of Zendesk","full_desc":"Mikkel Svane is the Founder and CEO of Zendesk, a software development company that was valued at $631 million in the IPO in May 2015. Mikkel has served as Chief Executive Officer since August 2007 and as a member of the board of directors since August 2007. He was appointed Chair of the board of directors in January 2014. Prior to founding Zendesk, Mikkel founded and served as the Chief Executive Officer of Caput A/S, a software company, and served as a technology consultant. He holds an A.P. in marketing management from Arhus Kobmandsskole. Mikkel is the author, along with Carlye Adler, of the book “Startupland” to be published by Jossey-Bass in December 2014.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tKeynote: Lessons Learned in Startupland\n    \t\t\t\t\t\t\t\tWednesday 10:15 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Mikkel_Svane_cropped-e1414328705645.jpg","type":"SPEAKER"},{"title":"JP Rangaswami","desc":"Chief Scientist at Salesforce.com","full_desc":"JP Rangaswami is Chief Scientist at salesforce.com, a global cloud-computing company and CRM provider listed in the NYSE. As Chief Scientist, Rangaswami focuses on helping salesforce.com’s European customers think about innovative ways to use the real-time, mobile and social capabilities provided by Salesforce apps and the Force.com platform.Originally an economist and financial journalist, he has spent the last 33 years working in information technology, primarily in the financial sector. He was named CIO of the Year by Waters Magazine in 2003, CIO Innovator of the Year by the European Technology Forum in 2004, European Innovator of the Year by Innovate in 2005; in 2007 and 2008, he was listed in Silicon.com’s Agenda Setters as one of technology’s 50 most influential people; in 2009 and 2010, he made the Wired 100 and was ranked 18th in 2010. More recently, he was ranked 4th in Computer Weekly’s 2013 list of the most influential people in IT.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tData science at Salesforce\n    \t\t\t\t\t\t\t\tTuesday 11:55 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/JP-Face-bw.jpg","type":"SPEAKER"},{"title":"Yuval Samet","desc":"Chief Product Officer at Klarna","full_desc":"Yuval Samet serves as the Chief Product Officer at Klarna, a company that provides e-commerce solutions for merchants and has raised $280 million of funding. At Klarna Yuval leads a group of 25 Product Managers and Product Designers, who are busy reinventing the way people buy online by fixing broken checkout experiences. In his role, he is responsible for the company’s vision execution, building the company’s product culture and discovery process and jointly deliver high quality software with Klarna’s engineering organization to attain the company’s business goals.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBuilding a product with +80% conversion in online shopping\n    \t\t\t\t\t\t\t\tWednesday 11:15 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Yuval-Samet.jpg","type":"SPEAKER"},{"title":"Sue Gardner","desc":"Journalist & Former Executive Director of Wikimedia","full_desc":"Sue Gardner is a journalist and the former Executive Director of Wikimedia Foundation, who scaled Wikipedia’s revenues from $2MM to $60MM, doubled its readership and tripled its article count, making Wikipedia the fastest-growing non-profit in the US.Sue has been described as the Mother Teresa of the Internet, a “librarian to the world,” and “the ultimate media game-changer.” Her work is motivated by the desire to ensure that everybody in the world has access to the information they want and need so they’re equipped to make good decisions about their lives. She used to do that directly, as a journalist: now she does it through and with others, by movement-building and organization-building.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tThe future of global internet\n    \t\t\t\t\t\t\t\tWednesday 11:20 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/sue-gardner.jpeg","type":"SPEAKER"},{"title":"Matti Alahuhta","desc":"Chairman of DevCo Partners, former President and CEO of Kone","full_desc":"Matti Alahuhta was the President and CEO of KONE Corporation from 2005 to 2014. Prior to KONE he spent 26 years at Nokia, where he was a member of the Group Executive Board for the last 12 years. He is currently on the boards of several companies and organizations. He is Chairman at DevCo Partners, at Outotec and at Aalto University Foundation and Vice Chairman at the Confederation of Finnish Industries and a Member of the Board at KONE, UPM, ABB and Volvo AB. His passion for strategy and leadership development led 1990 to a doctoral dissertation on “Global growth strategies for high technology challengers”.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat on leadership with former CEO of KONE\n    \t\t\t\t\t\t\t\tTuesday 12:10 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Matti-Alahuhta.jpg","type":"SPEAKER"},{"title":"Alan Mamedi","desc":"Co-founder and CEO of Truecaller","full_desc":"Do you ever get a call from an unknown number and you wished you knew who it was? Alan Mamedi is the Co-founder of the award-winning app Truecaller, the world’s largest verified mobile phone community. Truecaller has an extensive crowdsourced database of public, mobile, and even prepaid phone numbers. The app empowers users to block spam callers, identify incoming calls from businesses and individuals, and search for contact info and names of callers. Alan has overseen Truecaller’s incredible growth in the past year, coming from 19 million in June 2013 up to 85 million now. In April 2014 Truecaller raised $18.8 million in funding led by Sequoia Capital, followed by $60 million in October 2014 from Atomico, Kleiner Perkins Caufield & Byers and Sequoia Capital.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBuilding apps for fast-growth markets\n    \t\t\t\t\t\t\t\tWednesday 14:40 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/alan_mamedi.jpg","type":"SPEAKER"},{"title":"Linda Liukas","desc":"Founder of RailsGirls and Hello Ruby","full_desc":"Linda is a programmer, storyteller and illustrator from Helsinki, Finland. Her proposed children’s book, Hello Ruby, is the most funded book on Kickstarter’s children’s book category with 380 000$ funding in total.\nLinda is a central figure in the world of programming and has worked on edutech already before it was called that. Linda is the founder of Rails Girls, a global phenomenon teaching the basics of programming for young women all over the world. She has previously worked at Codecademy, a programming education company in New York with over 5 million users all over the world.Further, she believes that code is the 21st century literacy and the need for people to speak the ABC of Programming is imminent. She believes our world is increasingly run by software and we need more diversity in the people who are building it.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tSoftware & storytelling: one nordic childhood\n    \t\t\t\t\t\t\t\tWednesday 16:25 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/linda_liukas.jpg","type":"SPEAKER"},{"title":"Victor Kislyi","desc":"CEO of Wargaming","full_desc":"","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Victor_unofficial.jpg","type":"SPEAKER"},{"title":"Mika Salmi","desc":"CEO of CreativeLive","full_desc":"Mika Salmi is a recognized innovator in the technology and media sectors. He currently serves on numerous Boards, among them CreativeLive, INSEAD (global business school) and Feed.fm. Most recently, Mika served as CEO of CreativeLive. CreativeLive is transforming the $100 billion continuing education market by offering frictionless access to the best teachers in the world through a live, social video platform. Under his leadership, the company grew from 8 to 85 employees, revenues increased over 600% and the company raised over $30m from Greylock Partners, Social+Capital Partnership, William Morris Endeavor, Creative Artists Agency, Richard Branson, and others top names. Mika was previously President of Global Digital Media at Viacom and prior to that was the Founder/CEO of the pioneering video and games companies AtomFilms, Shockwave, and AddictingGames. He also founded a GPS and mobile-based game company, Mad Races, that was sold to Betaworks. He started his career in music notably discovering and signing Nine Inch Nails.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside on the psychology of raising money\n    \t\t\t\t\t\t\t\tWednesday 17:45 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Mika_Salmi_unofficial1.jpg","type":"SPEAKER"},{"title":"Chase Adam","desc":"Founder of Watsi","full_desc":"Before the age of 21, Chase traveled, worked, and studied in more than 20 countries around the world. He spent time in private sector intelligence in Washington, launched a national health program in Haiti, served in the Peace Corps in Costa Rica, and rode a motorcycle across Indonesia. In 2012 he founded Watsi, a nonprofit healthcare crowdsourcing platform, which enables individual donors to directly fund medical care for individuals in developing countries without access to affordable medical care. Today over 2000 treatments have been funded on their platform.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tStartup non-profits\n    \t\t\t\t\t\t\t\tWednesday 11:35 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/chase_adam.jpg","type":"SPEAKER"},{"title":"Jens Begemann","desc":"Co-founder and CEO of Wooga","full_desc":"Jens founded Wooga in 2009. With around 50M active players per month, Wooga is one of the most popular mobile game developers in the world. Jens is enthusiastic about people, play and technology. Guiding a team of talented people to develop quality games fulfills one of his lifelong ambitions. Before creating Wooga, Jens was the Chief Product Officer & Member of the Management Board at Jamba (Jamster), where he aided the company in becoming a world leader in mobile entertainment products.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tAll killers, no fillers! How stopping projects can make you more succesful\n    \t\t\t\t\t\t\t\tTuesday 10:50 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/jens_begemann.jpg","type":"SPEAKER"},{"title":"Leland Melvin","desc":"Retired Astronaut and Head of Education at NASA","full_desc":"Leland is a retired American NASA astronaut and engineer. He flew two missions on the Space Shuttle Atlantis. After hanging up his space boots as the head of NASA Education he has served the White House. Leland was the United States representative and chair of the International Space Education Board (ISEB). After 24 years with NASA as a researcher, astronaut and Senior Executive Service leader he looks to share his stories of perseverance, and excellence to inspire communities for lasting positive change.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tThe Right Stuff is the Never Give Up stuff\n    \t\t\t\t\t\t\t\tWednesday 12:15 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/Leland-Melvin-Official-Photo.jpg","type":"SPEAKER"},{"title":"Esa-Pekka Salonen","desc":"Principal Conductor of London Philharmonia Orchestra","full_desc":"A lauded composer and world-renowned conductor, Esa-Pekka Salonen has a restless innovation that marks him as one of the most important artists in classical music. Salonen is currently the Principal Conductor and Artistic Advisor of the Philharmonia Orchestra and Conductor Laureate for the Los Angeles Philharmonic, where he was Music Director from 1992 until 2009. The 2014-2015 season will find him as the first-ever Creative Chair at the Tonhalle Zurich Orchestra, which has commissioned a new piece for orchestra and chorus from him and will perform nine other Salonen pieces throughout the season.Esa-Pekka is also one of the great minds behind the Orchestra, an extraordinary app that allows real-time selection of multiple video and audio tracks, along with an automatically synchronised score and dynamic graphical note-by-note visualisation of each piece as it is played. The result is an immersive environment for exploring the music and all the instruments of the orchestra.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tLessons from leading the most talented musicians in the world\n    \t\t\t\t\t\t\t\tTuesday 13:40 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tOrchestrating Technology: Making Classical, Modern with Esa-Pekka Salonen\n    \t\t\t\t\t\t\t\tTuesday 14:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/Esa-Pekka-Salonen.jpg","type":"SPEAKER"},{"title":"Mikko Hyppönen","desc":"Chief Research Officer at F-Secure","full_desc":"Mikko Hyppönen is Chief Research Officer at F-Secure Corporation in Finland. He has led his team through the largest computer virus outbreaks in history. He named the infamous Storm Worm, was part of the Conficker Working Group and he has done classified briefings on the Stuxnet worm, a hugely complex worm designed to sabotage Iranian nuclear enrichment facilities.He has written for magazines such as Scientific American, Wired and Foreign Policy and for newspapers like The New York Times. In addition to the most important security-related conferences worldwide Mr. Hypponen has addressed SXSW, DLD, Google Zeitgeist, the EU Parliament and TED conference. He was selected among the 50 most important people on the web by the PC World magazine and was included in the FP Global 100 Thinkers list. He also received the Virus Bulletin Award as the “Best educator in industry”.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCybersecurity hour: R.I.P. Internet\n    \t\t\t\t\t\t\t\tTuesday 15:05 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Mikko_Hypponen.jpg","type":"SPEAKER"},{"title":"Peter Levin","desc":"President of Interactive Ventures and Games at Lionsgate","full_desc":"Peter Y. Levin is the President of Interactive Ventures and Games at Lionsgate, the leading independent producer and distributor of motion pictures, television programming, entertainment, video-on-demand and digitally delivered content. Prior to his current position, Levin served as CEO and Co-Founder of Nerdist Industries, a multi-platform creator of genre and popular-culture content. He also served as Co-President of Legendary Entertainment Digital after Legendary Entertainment acquired Nerdist Industries in July of 2012. Prior to Nerdist Industries, Levin served as President and Co-Founder of Intel Capital, Dentsu, Softbank and DoCoMo-backed Bellrock Media Inc., a mobile and broadband entertainment company creating and distributing premium content for mobile and broadband platforms throughout North America and Japan.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tMobile free to play meets brands: The perfect storm?\n    \t\t\t\t\t\t\t\tTuesday 12:15 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Peter-Levin-618x400.jpg","type":"SPEAKER"},{"title":"Brad Hargreaves","desc":"Co-Founder of General Assembly","full_desc":"Brad co-founded General Assembly and is largely focused on guiding General Assembly’s strategic growth. GA is a global educational institution that is building a community of individuals, and has $50 million of funding raised. From developing the initial business models down to the day-to-day operational execution, Brad has played a key role in General Assembly’s expansion to more than eight global markets in less than two years. Today, Brad is focused on directing the organization’s digital efforts, including the development of its online educational products which will help expand General Assembly’s reach and bring high-quality online education to millions. Most recently, Brad was named to Vanity Fair’s “The Next Establishment”, Inc Magazine’s “30 Under 30”, and Business Insider’s “Silicon Alley 100”.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCredentials and the Future of Education\n    \t\t\t\t\t\t\t\tWednesday 14:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/bradheadshot-1.jpg","type":"SPEAKER"},{"title":"Nicholas Haan","desc":"Director of Global Grand Challengers at Singularity University","full_desc":"Nick is currently Director of Global Grand Challenges at Singularity University. Nicholas Haan has worked at the intersection of science, technology, social challenges, and innovation for the last 25 years. His issues of focus have included disaster relief, food security, environment, energy, public health, education, genetics, and information systems. And his affiliations have included the United Nations, governments, universities, donor agencies and non-governmental organizations.Nick is also involved with several start-ups, including as strategic advisor to a mobile app company called eMobilis. He has a keen interest in the crowdsourcing movement and is on the regional board of directors for crowdfunder.com. He has been a visiting professor at University of Dar es Salaam, Tanzania; and was awarded a NASA Research Fellowship.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tExponential Technology and Solving Humanity's Grand Challenges\n    \t\t\t\t\t\t\t\tTuesday 13:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Nick-Haan1.jpg","type":"SPEAKER"},{"title":"Christian Macht","desc":"CEO of Rakuten Deutschland","full_desc":"Dr. Christian Macht joined Rakuten Deutschland as CEO in November 2013, sending a clear signal to take a leading position as a fully integrated ecosystem of online-services in Europe’s biggest economic area. He also took over responsibility for the European sales and operations of Rakuten from July 2014.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tRakuten's visions for Europe\n    \t\t\t\t\t\t\t\tWednesday 17:10 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Dr-Christian-Macht-533x800.jpg","type":"SPEAKER"},{"title":"Nadya Peek","desc":"Researcher at MIT Center for Bits and Atoms","full_desc":"Nadya Peek is a machine builder and PhD candidate at the MIT Center for Bits and Atoms, working on digital fabrication, technology for humans, and making machines that make. Nadya builds tools and automation systems for low-volume production and prototyping, with the aim to lower the threshold for building machines. Current projects include distributed control systems, foldable multipurpose fabrication tools, and reconfigurable machine construction sets.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tMaking machines that make\n    \t\t\t\t\t\t\t\tTuesday 15:25 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/nadyapeek.jpg","type":"SPEAKER"},{"title":"Nicolas Brusson","desc":"Co-founder and COO of BlaBlaCar","full_desc":"Nicolas is the co-founder & COO of BlaBlaCar, a transport network that allows people travelling in the same direction or destination to share a vehicle. He leads the company’s international growth and operations. Naturally pragmatic, he uses fast iteration to uncover high-growth opportunities. Nicolas is a strong advocate of local teams and acqui-hire, a strategy he implemented to expand BlaBlaCar’s footprint to a global scale. He also led BlaBlaCar’s $100m financing in July 2014. Nicolas started his career working for start-ups in Silicon Valley during the 2000 boom, moved on to executive and investor roles, and finally worked as a Venture Capitalist in London, before leading BlaBlaCar’s global expansion.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tEurope: big ocean, small fish\n    \t\t\t\t\t\t\t\tTuesday 14:40 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/MG_1172-2.jpg","type":"SPEAKER"},{"title":"Nils Hammar","desc":"CEO of Saltside Technologies","full_desc":"Nils Hammar is the founding CEO of Saltside, a company with a mission to create the largest, fastest and safest online marketplace for people in emerging markets, so that everyone can make great deals – for everything from cars and mobile phones to land and livestock. Their central belief is that access to an efficient marketplace improves people’s lives. The company has raised $25 million of funding in June 2014.Nils has 10 years of experience from fast growing international online businesses. He started his career in 2004 as one of the first employees at Skype, managing marketing and product management teams in Europe and the US. In 2007 he co-founded Kindo.com, a social network for the family, which was later acquired by top genealogy site Myheritage.com.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tThe Land of Opportunity\n    \t\t\t\t\t\t\t\tWednesday 11:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Nils-Hammar1.png","type":"SPEAKER"},{"title":"Willow Mellbratt","desc":"Game Designer at Toca Boca","full_desc":"Willow Mellbratt is a play designer at Toca Boca, the game studio devoted to bringing fun, creative and gender neutral digital toys to kids all over the world. Willow is going to talk about how to desing digital toys and child-friendly applications for tablets and smartphones. Willow has a Masters in Experience Design from Konstfack in Stockholm and has her background in digital play. While working at Penguin Books and IDEO she fell in love with roleplaying. Together with BRIO she has worked on a project entitled “Future of play”. At Toca Boca she now strives to bring play into every step of the design process.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tDeveloping games for kids\n    \t\t\t\t\t\t\t\tTuesday 11:30 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Willow_photo.jpg","type":"SPEAKER"},{"title":"Joel Roos","desc":"EVP Products of Hem","full_desc":"Joel founded Hem (earlier One Nordic Furniture Company) in 2012, steering the company from launch to exit in two and a half years. One Nordic was sold to Fab Inc. in 2014 in one of the largest deals ever made in the Finnish design sector. Joel currently works as the Executive Vice President of Products for Hem, a global design company with 200+ employees focusing on E-commerce sales of design furniture and accessories, and is an angel investor funding Nordic start-ups. On his free time Joel is an avid CrossFitter and runner, currently clocking 38 minutes for 10K.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tInventing furniture company for the digital age\n    \t\t\t\t\t\t\t\tTuesday 16:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/joel_6890.jpg","type":"SPEAKER"},{"title":"Carl Waldekranz","desc":"CEO and Co-founder of Tictail","full_desc":"Carl Waldekranz, 28 years old, is the CEO and co-founder of Tictail. With the vision to build the worlds most used and loved e-commerce platform, Tictail has become the home to more than 50,000 online stores since its launch 2 years ago. The first store on the platform was Carl’s own mother, By Mutti, who is now accompanied by global brands like Cheap Monday and Lufthansa, and independent brands such as Transparent Speaker and Deadwood. Before Tictail, Carl co-founded and sold a digital agency called Super Strikers, as well as founded Keyflow, a mobile guest list app company. Carl’s previous work includes development of the Spotify, Wrapp and Bambuser brand identity.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBuilding Tumblr for Ecommerce\n    \t\t\t\t\t\t\t\tTuesday 11:10 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Carl-Waldekranz-800x533.jpg","type":"SPEAKER"},{"title":"Hilmar Veigar Pétursson","desc":"CEO of CCP Games","full_desc":"Hilmar has been leading CCP Games’ ongoing success and growth since his appointment as Chief Executive Officer in 2004. Under Hilmar’s management CCP’s critically acclaimed science-fiction game EVE Online is celebrating an unprecedented tenth consecutive year of subscriber growth. The Company released its second title, DUST 514, a free-to-play, massively multiplayer first-person shooter for the PlayStation®3 in 2013 and is also developing EVE: Valkyrie, a multiplayer spaceship dogfighting shooter set in the EVE Universe. In addition, Hilmar has overseen the expansion of CCP operations to Shanghai, China as well as the strategic merger with Atlanta-based White Wolf Publishing in 2006,Before his appointment to the CEO position, Hilmar held the title of CCP’s CTO, heading the engineering effort required to create CCP’s persistent world technology and 3D engine. Prior to joining CCP in 2000, he served as the CTO of SmartVR, an OZ.com spin-off based on that company’s multi-user virtual reality technology following his tenure as the VP of software development for the OZ Studios division of OZ.com.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tHow Virtual reality will change gaming – and much more\n    \t\t\t\t\t\t\t\tTuesday 10:10 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Hilmar_cropped.jpg","type":"SPEAKER"},{"title":"Bob Slinn","desc":"Head of Gaming Partnerships for EMEA at Facebook","full_desc":"Bob Slinn is Head of Gaming Partnerships for EMEA at Facebook in London, United Kingdom. He is currently managing the EMEA gaming partners, as well as recruiting new developers for the Facebook platform, with a focus on supporting larger cross-platform partners across the region. Prior to Facebook, Bob held various roles at EA (Electronic Arts) in California, including Senior Director of Publishing. Bob was also previously Director of Media Operations at Yahoo,  where he led strategy and operations for all Yahoo!’s Media products in Europe. Bob holds a BA from University of Western Ontario in French Literature and History as well an MBA from York University in Toronto. Bob also speaks fluent French.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with Bob Slinn on the power of the Facebook gaming platform\n    \t\t\t\t\t\t\t\tTuesday 14:25 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Bob-Slinn1.jpg","type":"SPEAKER"},{"title":"Maarten de Koning","desc":"Partner and Executive Director of Business Development at DDM","full_desc":"With a background in investment management and game development, Maarten founded his own agency in 2009, before merging with Digital Development Management (DDM) in 2013.   Maarten’s principles of starting an agency were to provide business development, effective product management and consultation to video game developers. Maarten began his career in the industry as a game producer and is a certified Scrum Product Owner and Scrum Master.   Maarten is a Partner and Executive Director of Business Development at DDM, and is passionately servicing triple-A developers across the globe and is overseeing all business development for DDM in North America and Europe.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with Bob Slinn on the power of the Facebook gaming platform\n    \t\t\t\t\t\t\t\tTuesday 14:25 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Maarten_de_Koning.jpg","type":"SPEAKER"},{"title":"Linda Raftree","desc":"Co-founder of Technology Salon & Kurante","full_desc":"Linda Raftree has worked at the intersection of community development, participatory media, and information and communication technologies (ICT) since 1994, including 16 years working with Plan International. She recently co-founded Kurante, which supports organizations to better understand technology’s role in development programs and to implement strategic, high impact efforts that integrate innovative approaches and tools. Linda currently serves as a Special Advisor to the Rockefeller Foundation’s Evaluation Office on the use of ICTs for monitoring and evaluating social impact. She has conducted research on adolescent girls and ICTs for UNICEF, ICTs and child/youth migration for the Oak Foundation, and mobile technologies in youth workforce development for the mEducation Alliance. Linda coordinates Technology Salons in New York City and she advocates for greater dialogue and discussion around the ethical use of ICTs and data privacy in the humanitarian and development space. She writes ‘Wait… What?’ a blog about new technology and community development, and tweets at @meowtree.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTech is the easy part - how people-ware can make or break an innovation\n    \t\t\t\t\t\t\t\tWednesday 10:20 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/Linda-Raftree.jpeg","type":"SPEAKER"},{"title":"Walter Bender","desc":"Co-founder of One Laptop Per Child","full_desc":"Walter Bender is a co-founder of “One Laptop Per Child” (OLPC), an association developing a low-cost, connected laptop with technology and contents to empower learning. He is also the founder of Sugar Labs, a foundation supporting the community of educators and software developers using Sugar open-source environment (as a part of OLPC’s development). Between 2000 and 2006, he served as director of MIT Media Lab. Bender holds a BA from Harvard University and M.Sc from MIT","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tLearning, Expression, and Innovation\n    \t\t\t\t\t\t\t\tWednesday 12:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/Walter-Bender-cropped.jpg","type":"SPEAKER"},{"title":" Uli Weinberg","desc":"Director of D-School, Hasso Plattner Institute","full_desc":"Uli Weinberg is the Director of the School for Design Thinking and the Hasso Platter Institute. He’s going to share his stories about how we can make systemic change through enabling collaborative creativity.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/09/uli-weinberg-cropped.jpg","type":"SPEAKER"},{"title":"Doreen Kessy","desc":"COO at Ubongo","full_desc":"Doreen Kessy is a business management professional passionate about bringing forth social change through edtech in Africa. She is a COO at Ubongo, a Tanzanian based social enterprise that creates interactive edutainment for learners in Africa, delivered to them via the technologies they already have.Doreen has also worked at various organizations including International Justice Mission, Wells Fargo and Smile for Africa. She has an MBA and a B.S in International Business and Economics from Liberty University in Virginia. She also does the English voice of Ngedere on Ubongo’s interactive edu-cartooon known as Ubongo Kids.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tScaling an education startup in Africa\n    \t\t\t\t\t\t\t\tWednesday 16:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/doreen.jpg","type":"SPEAKER"},{"title":"Markku Mäkeläinen","desc":"Director, Global Operator Partnerships, Facebook Inc.","full_desc":"Markku Makelainen is responsible for Global Operator Partnerships at Facebook. Prior to Facebook’s acquisition of Pryte.com, Markku served as CEO and Founder. Before Pryte, Markku spent fifteen years working with different mobile internet growth companies mainly focusing on developing mobile data markets. Markku has an MSc from the University of Technology in Helsinki.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tConnecting the world\n    \t\t\t\t\t\t\t\tWednesday 10:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Markku-Makelainen.jpg","type":"SPEAKER"},{"title":"Jessica Colaco","desc":"Director of Partnerships, iHub","full_desc":"Jessica Colaço is currently the Director of Partnerships at iHub. She was the Founding Manager between 2010 and 2011 at iHub and Research Director between 2011 and 2013 at iHub Research. She is passionate about Innovation, Research, Mobile and Robotics Technology, Mentorship and Entrepreneurship in Kenya as she uses her position at iHub to court local, regional and international stakeholders to adopt Kenyan-made and African-made solutions. As an upcoming angel investor, she courts local and international investors to invest in great tech ideas and companies at idea and concept stage. She is also a Mobile and Robotics Tech Evangelist, Co-Founder of WMIAfrica and AkiraChix, ISOC-Kenya Chapter, Treasurer, ACM-W Nairobi Chapter Chair, TED Global Fellow 2009 and upcoming Guitarist. She was named one of the top 40 women under 40 years in Kenya’s business scene by Business Daily on 2009, 2011 and 2012.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/jessica-colaco.jpg","type":"SPEAKER"},{"title":"Tanya Accone","desc":"Senior Advisor on Innovation, UNICEF","full_desc":"Tanya Accone’s career has focused on helping international public and private sector organizations amplify their impact through the convergence of innovation, communication and technology. Her focus is on applying innovation for social impact and as a public good. Accone characterizes her role as “standing at the intersection where the rubber of ideas, meets the road of reality, trying to organize vehicles for the world’s most marginalized children so they too have the information, opportunity and choice to be empowered drivers of their own destiny.”","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTech is the easy part - how people-ware can make or break an innovation\n    \t\t\t\t\t\t\t\tWednesday 10:20 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/BHK_10_LIn.jpg","type":"SPEAKER"},{"title":"Vineet Bewtra","desc":"Director, Investments, Omidyar Network","full_desc":"Vineet leads Omidyar Network’s impact investing strategy in and from Europe. He is also responsible for leading Omidyar Network’s education-related investments across Africa as well as globally applicable platforms coming out of Europe. Vineet joined Omidyar Network in mid-2011, before which he spent three years as an investment manager at The Children’s Investment Fund Foundation. He spearheaded the foundation’s work in educational achievement, concentrating on Sub-Saharan Africa and India. His work included leading an innovative remedial education program with the Government of Ghana aimed at improving the literacy and numeracy of primary schoolchildren, developing the foundation’s straregy around early childhood education, and creating school-based deworming programs. Previously, Vineet worked for 14 years in Europe’s structured and illiquid fixed income markets. He served as managing director at Dresdner Kleinwort, running a proprietary investment desk and participating on the firm’s underwriting committee. Vineet also worked at Lehman Brothers, Deutsche Bank, and Chemical. Vineet received a BA with honors from Cambridge University and an MSc in development management from the London School of Economics.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with Impact Investors\n    \t\t\t\t\t\t\t\tWednesday 10:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Vineet-Bewtra-square.jpg","type":"SPEAKER"},{"title":"René Parker","desc":"CEO of RLabs","full_desc":"René Parker is the CEO of RLabs a global social enterprise with a strong focus on Community-driven Innovation and Social Change operating in 22 countries serving more than 5 million people. René has been instrumental in the growth of RLabs in East Africa setting up its operations in Tanzania and founded the Women in ICT Faculty that currently serves thousands of women annually through digital skills. She also joined the board of the Living Labs in Southern Africa (LLiSA) network where she fulfills the portfolio of Capacity Building and Community Development and a key member of the AfriLabs network. René also co-founded the award winning technology media start-up “She’s The Geek” that provide training and consulting where she had the privileged of working with global brands. She is a sought after speaker and thought leader who provides a variety of consulting services in International Development and Community Innovation to both private and public sector. She also serves in an advisory capacity to a number of international universities. Four things her RLabs team in Cape Town say about her: passionate, kind, motivated and patient.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/rene.jpeg","type":"SPEAKER"},{"title":"Henrik Storm Dyrssen","desc":"CEO, Leksell Social Ventures","full_desc":"Henrik is the CEO of Leksell Social Ventures, initiated with Swedish med-tech billionaire Laurent Leksell and family. LSV is the first professional investment company for social innovation in Sweden. Henrik has a background in international relations in the Middle East, East African micro finance and global investment banking in London.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/henrik-dryssen-cropped.png","type":"SPEAKER"},{"title":"Michael Staton","desc":"Partner at Learn Capital","full_desc":"Michael Staton is a Partner at Learn Capital, where he has helped lead investments into Coursera, CreativeLIVE, Kalibrr, BrightBytes, and MakersRow. Prior to joining LearnCapital, for five years he advised and worked with industry leading companies, such as Dev Bootcamp, Quizlet, and Goalbook. He is the founder and former CEO of Uversity, the pioneer of Social Enrollment Management technology in Higher Education. Michael serves as a Venture Partner and Community Advisor to NewSchools Venture Fund’s Seed Fund, and began his career as a classroom teacher. Michael was declared a top one hundred innovator by the Chronicle of Higher Education, and he is on the advisory board of SXSWedu and the Higher Education Working Group of the American Enterprise Institute.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tGlobal Trends in Education and Learning Technologies\n    \t\t\t\t\t\t\t\tWednesday 14:25 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Michael-Staton-Headshot.png","type":"SPEAKER"},{"title":"Srini Swaminathan","desc":"Alumnus of Tech for India","full_desc":"","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/09/srini.jpg","type":"SPEAKER"},{"title":"Sanna Lukander","desc":"VP of Learning at Rovio","full_desc":"","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/09/sanna.jpg","type":"SPEAKER"},{"title":"John Martin","desc":"CEO of Sanoma Learning","full_desc":"John Martin is CEO of Sanoma Learning.  Sanoma serves about 10 m pupils and 1 m teachers with learning solutions and is a leading and integral partner in some of the World’s best performing education systems including Finland, The Netherlands, Belgium and Poland, as well as Sweden. Sanoma employs about 1600 learning professionals and is a frontrunner in the digital transformation, generating about € 50 m of annual pure-play digital and € 100 m multi-channel solution sales, making it one of continental Europe’s biggest K-12 edtech companies today.  Martin was previously responsible for Group Digital and Strategy at Sanoma.  He has a background in scientific publishing and holds a Ph.D. in molecular biology.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tEdtech transforming the way we learn\n    \t\t\t\t\t\t\t\tWednesday 13:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/John-Martin.jpg","type":"SPEAKER"},{"title":"Caroline Walerud","desc":"Co-Founder and CEO of Volumental","full_desc":"Caroline Walerud, Co-founder and CEO of Volumental, is a serial entrepreneur with a degree in Natural Sciences from Cambridge University who has already lead eight organisations in their growth. In November 2012, she co-founded Volumental with three computer vision experts at KTH Royal Institute of Technology in Stockholm.Volumental is creating a platform for the future of product customization by making 3D scanning of people fast, easy and accurate using off-the-shelf consumer depth cameras and cloud software. In September 2014 Volumental announced a $3 Million seed investment and a partnership with Intel. Volumental is currently working on several POCs with leading companies in orthotics and fashion retail. Caroline topped the Swedish magazine Veckans Affärer’s top 101 Super-Talents under 40 in 2013 and was ranked as one of Expressen’s Women of the Year in 2014.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBuilding a world of fully customised products\n    \t\t\t\t\t\t\t\tTuesday 15:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Caroline_Walerud1.jpg","type":"SPEAKER"},{"title":"Andreas Bernström","desc":"Founder and CEO of Sinch","full_desc":"Andreas Bernström is the founder & CEO of Sinch, a communications platform for mobile and web developers. The company employs 50 staff in Stockholm and San Francisco and manages around 100m transactions a month – Sinch is a spin off from Rebtel the global mVoIP giant that Andreas ran for almost 5 years. Andreas joined Rebtel in 2009 as CEO and grew revenues 5X to $100m and the user base to 25m globally. Andreas also holds the position of Industrial Advisor at EQT Partners the 22bn Euro Private Equity firm. Andreas started his career at Goldman Sachs, but after 3 years moved to TradeDoubler to become MD, where between 2002-2007 he grew revenues from $4m-110m. In 2007, Andreas was promoted to COO of TradeDoubler, leading 600+ employees generating $500 million in revenues operating in 19 territories. Andreas is also a regular writer for WSJ, Huffington Post, Venture Beat, TechCrunch and several other publications.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWhy communications is more valuable than ever, just not for operators\n    \t\t\t\t\t\t\t\tWednesday 14:55 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Andreas_Bernstrom.jpg","type":"SPEAKER"},{"title":"Karin Nilsdotter","desc":"Astropreneur, space traveller and community builder","full_desc":"Karin is Co-Founder and CEO of Space Travel Alliance and Managing Partner of Spaceport Sweden, two pioneering initiatives to realize the dream of commercial space travel; establishing Europe’s gateway to space in Swedish Lapland and a leading spaceline for tourism, research and education. The sky is not the limit as Karin seeks to launch not only spaceships but also new products, experiences and careers, inspiring and empowering talent and startups building a new industry. Passionate about innovation, Karin has led the development of a space tourism and training program, founded TEDxKiruna and initiated Creative Space; a do-tank for young talent across science, arts and tourism. Awarded for her pioneering work Karin has further been ranked as one of the leading women in Newspace for her drive to invigorate tourism locally, empower communities globally and advance Sweden as an aerospace innovation leader.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tThe development of space tourism and it’s possibilities for startups\n    \t\t\t\t\t\t\t\tWednesday 16:10 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/DSC_0090s2.jpg","type":"SPEAKER"},{"title":"Roland Lamb","desc":"Founder and CEO of Roli","full_desc":"Roland Lamb is an award-winning designer and entrepreneur. At eighteen he moved to a monastery in Japan to practice Zen Buddhism, and then traveled extensively, working as a visual artist and jazz musician. A passion for cross-cultural thought brought him to Harvard, where he concentrated on Classical Chinese and Sanskrit philosophy, before studying in the Design Products department at the Royal College of Art.Roland is the founder and CEO of ROLI, and inventor of the Seaboard GRAND—a musical instrument that re-imagines the keyboard as a sensitive, soft three-dimensional surface that enables unprecedented intuitive manipulation of the fundamental characteristics of sound. He and his wife, the novelist Tahmima Anam, live in East London with their son, Rumi.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tROLI Presents, The Seaboard GRAND\n    \t\t\t\t\t\t\t\tTuesday 14:35 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Roland-Lamb-with-Seaboard.jpg","type":"SPEAKER"},{"title":"Paul Murphy","desc":"Co-Founder and CEO of Dots","full_desc":"Paul Murphy is the co-founder and CEO of Dots, a leading mobile gaming studio focused on the intersection of art and entertainment. Both the original Dots and this year’s TwoDots have been some of the biggest hits on the App Store, both in terms of downloads and monetization. Prior to Dots, Paul helped start and fund a handful of successful startups as a partner at betaworks, including Giphy, Bloglovin, and Rushmore. Prior to betaworks, helped lead Aviary’s (acquired by Adobe) pivot to a mobile photo editing platform as their COO, which ultimately led to Aviary’s acquisition by Adobe. Before Aviary, he was chief of staff for the President of Microsoft’s Business Division. Paul is an advisor, investor, and board member for a number of startups. He holds a Computer Engineering degree from Virginia Tech and an MBA from IE Business School in Madrid.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Inside a startup studio\n    \t\t\t\t\t\t\t\tTuesday 16:15 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBenefits of building a brand-first gaming studio\n    \t\t\t\t\t\t\t\tTuesday 15:10 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Paul_Murphy.jpg","type":"SPEAKER"},{"title":"Daniel Kjellen","desc":"Co-Founder and CEO of Tink","full_desc":"Daniel Kjellén, CEO and co-founder of Tink, the personal finance app that makes it simple, smart and fun to see what you spend your money on. Daniel Kjellén and Fredrik Hedberg founded Tink in 2012 and in 2013 the Tink app was released to the Swedish market. In September Tink raised $4 USD in funding lead by Sunstone Capital for an international launch. Daniel has previously founded a domain sales company and been working for Carnegie Investment Bank. Now he wants to make personal finance much more engaging and personal.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Daniel_cropped.jpg","type":"SPEAKER"},{"title":"Mattias Ljungman","desc":"Co-Founder of Atomico","full_desc":"Mattias launched Atomico in 2006 alongside Niklas Zennström, sourcing investments and building Atomico’s team of experts who help portfolio companies to scale globally. In that time, Mattias has been involved with exits or substantial transactions in companies including Supercell (sold a majority stake to SoftBank valuing the business at $3bn in 2013), The Climate Corporation (acquired by Monsanto for $1.1B in 2013), Xobni (acquired by Yahoo! in 2013) and Power Reviews (acquired by Bazaarvoice in 2012).Mattias works closely with a number of portfolio companies on their expansion, including Supercell, Klarna, Hailo, 6Wunderkinder and Truecaller. He also leads the work of Atomico’s experienced global team on the ground in China, Japan, Brazil, Turkey and Korea, helping portfolio companies to scale into these major international markets. The team also helps founders with other skills that may not be native to them but which are critical to get right in a growing business, like talent and communications.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tGreat companies can come from anywhere\n    \t\t\t\t\t\t\t\tWednesday 12:35 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Mattias_Ljungman.jpg","type":"SPEAKER"},{"title":"John Lindfors","desc":"Partner at DST Global","full_desc":"After graduating from the Swedish School of Economics in Helsinki in 1993, John joined Goldman Sachs in London as a Financial Analyst. After 17 years at the company in different positions, he ended up leading the European Technology and Media investment banking department from 2005 onwards as a Partner of Goldman Sachs.In 2010, John left Goldman Sachs to join DST Global, which is a growth-focused investment fund targeting founder-led category leaders in the internet and tech space. In the last five years, DST Global has invested more than $4 billion in companies such as Facebook, Alibaba Group, JD.com, Xiaomi, Flipkart, Spotify, AirBnB, Lending Club and many others.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tA Few Perspectives on Internet in Asia\n    \t\t\t\t\t\t\t\tTuesday 17:45 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/John_Lindfors.jpg","type":"SPEAKER"},{"title":"Steven Dietz","desc":"Partner at Upfront Ventures","full_desc":"Steven has been a Partner at Upfront since its founding in 1996. Upfront Ventures is a VC firm focusing on investments in early stage technology companies, with totals of $800 million. Prior to Upfront, Steven was a Senior Vice President of Donaldson, Lufkin and Jenrette in the Investment Banking Division. He was also a member of DLJ’s Retailing Group for 14 years, where he provided advisory and capital raising services to more than 30 different retailers and numerous information technology companies. Steven focuses on investments in early-stage companies in Financial Services and Technology, Consumer, SaaS, and Big Data.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tYou have the VC meeting scheduled!  What do you talk about?\n    \t\t\t\t\t\t\t\tWednesday 13:50 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/09/Steven_cropped.jpg","type":"SPEAKER"},{"title":"Nikolaj Nyholm","desc":"Partner at Sunstone Capital","full_desc":"Nikolaj is a serial technology entrepreneur and investor. He has founded four pioneering technology startups and is now a partner at the Nordic-based early-stage venture capital investor, Sunstone Capital.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tInvestor talk\n    \t\t\t\t\t\t\t\tWednesday 14:05 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/nikolaj_nyholm.jpg","type":"SPEAKER"},{"title":"Alexander Galitsky","desc":"Co-founder and managing partner at Almaz Capital","full_desc":"Alexander Galitsky is a Co-Founder and Managing Partner of Almaz Capital Partners. Alexander is a well-known entrepreneur and investor in Russia/CIS, Europe and USA. Prior to Almaz, Alexander formed the ICT investment practice at Russian Technologies, one of the first venture capital funds in Russia and founded five successful high-tech companies. Before becoming an entrepreneur, Alexander served as one of the top technical executives for the Soviet space industry, where he worked on the MIR space station and the Soviet “Star Wars” response. Alexander has been honored numerous times as the most influential person in the Russian IT and Internet industry by Forbes. Alexander serves on the Skolkovo Foundation Board and as Chairman of the advisor committee for Russian Venture Company.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with Arkady Dvorkovich, Viktor Vekselberg, Dmitry Chikhachev, Alexander Galitsky and Pekka Viljakainen - Special session: Making money out of Russia\n    \t\t\t\t\t\t\t\tTuesday 12:30 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Alexander-Galitsky.jpg","type":"SPEAKER"},{"title":"Alex Arias","desc":"Co-Founder and CEO of Omniata","full_desc":"Alex Arias is the CEO and co-founder of Omniata, a unified data and engagement platform.\nFor more than 10 years, Alex has been an entrepreneur and driver of innovation in digital services. In 2007 the platform he built to deliver mobile content to telecoms, was acquired by Digital Chocolate, where he spent the next 4 years leading the vision of CRM, e-commerce and BI solutions. He then continued at EA as a Director of Product Management, leading the vision for the global data and engagement platforms. It has been 2 years now since he has embarked on his own journey into data discover and is pleased to be present at Slush 2014 having gained many of the leading gaming companies as clients already.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Why would you relocate from Silicon Valley to the Nordics?\n    \t\t\t\t\t\t\t\tWednesday 16:05 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Alex_Arias.jpg","type":"SPEAKER"},{"title":"Peter Griffith","desc":"Head Of Phones Design of Microsoft","full_desc":"Peter Griffith has been the Head of Phones Design in Microsoft since September 2014. He has led industrial design teams at Nokia for eight years, most recently the Mobile Phones Industrial Design. Together, these teams have designed some of Nokia’s best-selling devices such as Nokia 105, Nokia 206, as well as the Nokia Asha family and the Nokia X devices.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tMaterials are the ignition point for our work\n    \t\t\t\t\t\t\t\tTuesday 17:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Peter_Griffith.jpg","type":"SPEAKER"},{"title":"Pia Henrietta Kekäläinen","desc":"Founder of mehackit.org","full_desc":"Mehackit strives to have every child and youth experiment with technology in an open setting. Mehackit is launching a high school pilot as you’re reading this, and they’re excited to take on new pupils across Scandinavian schools in the near future. In her speech, she will tell you how every 15-year old can become an enthusiastic teacher of technology to the younger ones, and how design challenges can change learning.Henrietta graduated from Singularity University’s Graduate Summer Program 2013, aimed to combat humanity’s greatest challenges with exponential technologies. Previously, she helped scale out Rails Girls and has been building entrepreneurial communities in Vienna and Helsinki. Henrietta is also a World Economic Forum Global Shaper from the Helsinki Hub (and on a persistent mission to save the world).","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Pia_Henrietta_Kekalainen.jpg","type":"SPEAKER"},{"title":"Yaacov Hecht","desc":"Founder of Democratic School","full_desc":"Yaacov Hecht is an internationally distinguished leader and visionary in democratic education, learning theory, and societal change. He founded the Democratic School in Hadera, Israel, in 1987. It was the first school in the world to call itself democratic. Hecht’s aspiration is that the “pyramid classroom,” 30 students in front of a single teacher, will transform into a “learning social network,” comprised of 31 teachers and students – a network in which each student or teacher can teach his/her areas of strength and learn from the strengths of others. Hecht believes we are approaching a new groundbreaking educational solution – a transition from the schools of the industrial age to a “learning social network” – and its implementation, which he refers to as an “Education City.” Most recently, in 2010, Hecht co-founded “Education Cities-the Art of Collaborations,” an organization which focuses on turning educational systems into a central growth instrument for the cities in which they exist. Hecht continues to be a sought after speaker and consultant, and plays an essential role in the movement for democratic education in Israel and around the world.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: From teaching to learning\n    \t\t\t\t\t\t\t\tWednesday 13:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Yaacov_Hecht.jpg","type":"SPEAKER"},{"title":"Tim Vanderham","desc":"VP Cloud Platform Development of IBM","full_desc":"Tim Vanderham is the Vice President responsible for the world wide development, delivery, operations, and support of the IBM Platform as a Service and the development and integration of the IBM Cloud Marketplace. Tim was the Director of Development for PureApplication where he lead a worldwide team that created and delivered the technology to market.  Prior to that role, he held a number of management roles within the WebSphere development organization spanning support and services through development and delivery.  In all of his roles, he is very active in the technical and public community through giving keynotes at conferences and through his close work with clients worldwide.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tHow APIs and open innovation will change every industry\n    \t\t\t\t\t\t\t\tTuesday 11:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Tim_Vanderham_cropped.jpg","type":"SPEAKER"},{"title":"Haig A. Peter","desc":"Cognitive Computing Ambassador at IBM Research","full_desc":"Haig A. Peter is a Cognitive Computing Ambassador at IBM Research – Zurich having joined the IBM Corporation in 2000. As an ambassador at IBM, Haig meets with hundreds of clients annually to help them understand how cognitive computing systems can learn and interact naturally with people to extend what either humans or machine could do on their own, particularly when it comes to making better decisions by penetrating the complexity of Big Data.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Haig-A-Peter-cropped.jpg","type":"SPEAKER"},{"title":"Tiina Zilliacus","desc":"Founder and CEO of Gajatri Studios","full_desc":"Tiina is the Founder and CEO of Gajatri Studios, a Helsinki-based mobile games studio that focuses on integrating authentic well-being content with fun mobile free-to-play games format. The company develops Yoga Retreat, the world’s first yoga themed mobile simulation game targeted at female gaming audience. During her 17 years career in mobile Tiina has ramped up and managed several b2c services both as start-up CEO and Nokia executive. Tiina is passionate yoga practitioner since 10 years and huge well-being enthusiast.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCreating a game around well-being content\n    \t\t\t\t\t\t\t\tTuesday 11:40 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Tiina_bw.png","type":"SPEAKER"},{"title":"Teemu Huuhtanen","desc":"CEO of Next Games","full_desc":"Teemu Huuhtanen is the CEO of Next Games, the fresh Finnish mobile game studio founded in 2013. Teemu leads Next Games’ business development and is determined to build Next Games into a flourishing game company with its foundations strongly rooted in both internally developed and premium 3rd party IP games. Working in collaboration with AMC, they are currently developing a mobile game based on the blockbuster TV series The Walking Dead as well as a game based on their own intellectual property. With 15+ years of games business experience, his previous roles include business development with Rovio and Sulake, the makers of Habbo Hotel, as well as managing his own games company. Teemu is a firm believer in an open work culture and with the rest of the Next Games family, he shares a profound love for games and a burning desire to develop lasting global entertainment.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tNext Games announces its first game!\n    \t\t\t\t\t\t\t\tTuesday 11:00 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tMobile free to play meets brands: The perfect storm?\n    \t\t\t\t\t\t\t\tTuesday 12:15 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Teemu_cropped.png","type":"SPEAKER"},{"title":"Tyler York","desc":"Director of Business Development at Fuel Powered","full_desc":"Tyler’s ambitions in the game industry began at 12 when he was making custom maps for Starcraft: Brood War. As the Director of Business Development at Fuel, he helps game publishers make the most of their investments with multiplayer and live ops. Tyler began his startup career as a True Ventures’ TEC fellow, interning at SendMe Mobile, a mobile content company, and moonlighting for Lookout Mobile Security, the world’s leading mobile security company before joining Betable to lead developer and player marketing. Tyler graduated from Carnegie Mellon University with a BS in Marketing and a focus in Entrepreneurship.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tUnlocking Long Term Success with Live Ops\n    \t\t\t\t\t\t\t\tTuesday 13:45 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Tyler_York.jpg","type":"SPEAKER"},{"title":"Dan Brody","desc":"VP for Business Development at Tencent","full_desc":"Dan Brody is VP for Business Development at Tencent. As part of the Interactive Entertainment Group which has overall responsibility for Tencent’s gaming initiatives, Dan serves as the interface with companies based in western markets. Over half of Tencent’s revenue comes for games, and a significant portion of that is from internationally licensed games, so Dan’s division is responsible for bringing in the world’s best games to China’s largest group of gamers, as well as evaluating investment possibilities in Western markets. Previously, Dan served a variety of executive management roles with Spotify, Tudou, Google, Motorola, USITO, and several startups, as well as several years on the board of the American Chamber of Commerce in China. Dan has lived in China since graduating from Georgetown University SFS in 1996, and as a former interpreter is fluent in written and spoken Mandarin.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWin Together with Tencent\n    \t\t\t\t\t\t\t\tTuesday 13:30 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Dan_Brody_cropped.jpg","type":"SPEAKER"},{"title":"Piyush Shah","desc":"VP of Products at InMobi","full_desc":"Piyush Shah joined InMobi in October 2009 and currently serves as Vice President of Products. InMobi is a mobile-first platform allowing brands, developers and publishers to engage consumers through mobile advertisement by leveraging data and user behaviour. They have raised $215 million in funding. Piyush is responsible for the overall vision, strategy and execution for the InMobi product portfolio. Prior to taking on the role of VP of Products, Piyush was the Vice President and General Manager for Performance Advertising – helping customers to acquire quality users through app installs and lead generation offerings.Piyush brings to InMobi over 13 years of experience in entrepreneurship, strategy, business development, product management and operations.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Piyus_Shah.jpg","type":"SPEAKER"},{"title":"Stephen Upstone","desc":"CEO and Co-Founder of LoopMe","full_desc":"Stephen started working in mobile advertising in 2006. He was Managing Director Europe for Ad Infuse (sold to Velti) and then VP Sales and Business Development Europe for Velti after the takeover. Stephen was part of the senior management team that successfully listed Velti on the NASDAQ and was present in New York for the ringing of the opening bell.\nWhilst at Ad Infuse & Velti, Stephen opened offices across the globe, helping to build a mulit-million dollar business, working with companies such as Vodafone, Orange, T Mobile, Sky and Daily Mail. Prior to Ad Infuse Stephen worked at Touch Clarity (sold to Omniture), FirstCapital, Universal McCann and Lowe Howard Spink.\nHe is Chairman of the MMA UK Advisory Board and member of the EMEA Board. Stephen was previously Co-Chair of the Global Advertising Committee and was a Member of the IAB Mobile Advertising Committee. With over 18 years’ experience in advertising and technology, Stephen is a practised commentator and speaker.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tA Framework for App Brand Marketing\n    \t\t\t\t\t\t\t\tTuesday 14:15 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Stephen.jpg","type":"SPEAKER"},{"title":"Sten Tamkivi","desc":"CEO of Teleport, Inc.","full_desc":"Sten is the CEO of Teleport, Inc, the search engine for digital nomads. Prior to co-founding Teleport he served at Skype as an early executive, riding the roller coaster for over 8 years from startup to the $8.5B exit to MSFT. Sten started his entrepreneurial career founding the first digital media agency in Estonia at the age of 18 and has stayed on the forefront of internet, user experience design and software development scene since 1996. Sten values a tolerant, open and creative society, speaks up for entrepreneurship, supports the startup movement, occasionally invests, pushes for better tech education and has advised President Ilves of Estonia on the above. He also holds a number of management and advisory board seats and blogs at sten.tamkivi.com.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTeleport: Place Scout for Startup People\n    \t\t\t\t\t\t\t\tWednesday 14:25 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Sten_cropped.png","type":"SPEAKER"},{"title":"Manish Agarwal","desc":"CEo of Reliance Internatio","full_desc":"Manish Agarwal is the CEO of Reliance Entertainment Digital where he oversees digital businesses which include gaming companies Zapak and Reliance Games, movie steaming service BigFlix and digital strategy and execution company World Wide Open! Over a 16-year career he has successfully been associated with some of the best brands and organizations — Unilever, Microsoft, Rediff, Infosys and UTV to name a few. Manish’s expertise spans across consumer psychology and translating it into products and leveraging digital marketing and developer ecosystems to create consumer centric scalable business from scratch. A self-confessed “intrapreneur” he has strong inclination to work with startups to keep his mind fertile for incubating new ideas which can change the way consumers live their life today. He is passionate towards bringing the product thinking which exists in India on global map and showcase world class products coming out from Indian companies. He is living his dream to see India on the world map of mobile gaming by creating immensely successful mobile games for a global audience.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Bringing Indian product thinking to global markets \n    \t\t\t\t\t\t\t\tTuesday 12:45 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Manish_Agarwal.jpg","type":"SPEAKER"},{"title":"Rafael Torres","desc":"Senior Managing Director and Healthcare Leader at GE Ventures","full_desc":"Rafael Torres leads the VC team for healthcare investments and directs portfolio strategy. Under Rafael’s leadership, GE Ventures has invested in multiple successful healthcare businesses including Nanostring (NASDAQ: NSTG) and Veracyte (NASDAQ: VCTY). Previously, Rafael was the global healthcare leader for GE Equity, GE’s private equity platform, where he built a practice with over 30 investments including ParadigmHealth (Alere), Navinet (Horizon Blue Cross) and Euromedic (BAML Capital). Rafael has had a variety of board roles including CardioDx, InSightec, Navinet, ParadigmHealth and LipoScience. In previous roles at GE, Rafael served as an operating executive in the integration of GE’s largest healthcare acquisition, Amersham and in the M&A team of GE Healthcare. He has been a judge in the Assembling Tools to Fight Cancer challenge by GE and featured in leading healthcare publications including The Gray Sheet, Medical Device Daily and MedCity News. Before joining GE, Rafael held various positions at The Boston Consulting Group, AT Investments and Citibank. Rafael received his MBA from Harvard Business School and BA in Economics from Universidad del Pacifico. Rafael lives in the Silicon Valley with his wife and two boys. He notes his 4-year old son needed a CT-scan before his appendectomy and asked the radiologist if it were a GE scanner. Could it be in the blood?","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat: Trends and opportunities in health care\n    \t\t\t\t\t\t\t\tWednesday 14:55 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Rafael_Torres.png","type":"SPEAKER"},{"title":"Ulli Koop","desc":"Founder and CEO of XLHEALTH","full_desc":"Ulli Jendrik Koop is the founder and CEO of XLHEALTH, an investor for Digital Health startups. He envisions the future of Digital Health to enhance personal responsibility in health by providing access to health related information and enabling users to make better decisions, thus improving their health. Prior to founding XLHEALTH, Ulli worked for CompuGroup Medical, one of the leading eHealth companies worldwide developing software products and services supporting all medical and organizational activities of healthcare providers. He gathered both strategic and operational expertise throughout Europe and the United States. Ulli studied in Shanghai, Aachen and Vallendar and obtained a Master’s degree from WHU – Otto Beisheim School of Management.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFrom patient to person - how digital health disrupts healthcare?\n    \t\t\t\t\t\t\t\tWednesday 16:20 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/M-Ulli-jendrik-koop-vorstand-xlh-ohne-anschnitt.jpg","type":"SPEAKER"},{"title":"Samu Konttinen","desc":"Executive Vice President, Consumer Security of F-Secure Corporation","full_desc":"Samu Konttinen is the Executive Vice President, Consumer Security of F-Secure Corporation. He has strong background in global Sales and Marketing and channel management covering F-Secure operations in +20 countries in EMEA. Samu is enthusiastic about technology and has been succesfully guiding a team of talented people to develop quality consumer security services. Before joining F-Secure he worked for Valimo Wireless Ltd., a company pioneering new technology that enable new mobile concepts. Samu Konttinen is also a member of the board of Ixonos Plc.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tStartup within a multinational Corporate – Long live Freedome!\n    \t\t\t\t\t\t\t\tTuesday 10:55 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Samu_Konttinen.jpg","type":"SPEAKER"},{"title":"Adam Shaw","desc":"Founding partner of Structure Partners","full_desc":"Adam is the founding partner of Structure Partners, a boutique venture capital firm. Prior to Structure, Adam served as Chief Executive Officer of Digital Artists Entertainment (DA) where he oversaw the development and distribution of innovative and talent-driven original content for a global digital audience. DA was co-founded with Creative Artists Agency (CAA) and backed by Deep Fork Capital.Prior to DA, Adam spearheaded the launch of NFL Network, which was the fastest-ever Cable Network to reach 40-million subscribers and granted him acknowledgment as one of TV Week’s “10 to Watch” as well as Sports Business Journal’s “40 Under 40.”Before working for the NFL, Adam worked for Fox for seven years, where he played a key role in launching and acquiring networks such as Fox Sports Net, and National Geographic, and led M&A deals involving the LA Dodgers, Liberty Holdings, and Cablevision. While serving as the head of business and operations for FX, Shaw was instrumental in the transformation of FX into a leading basic cable network through its development of quality original programming.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tLaunch: A US accelerator tapping into Nordic talent\n    \t\t\t\t\t\t\t\tWednesday 13:25 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Adam_Shaw.jpg","type":"SPEAKER"},{"title":"Esko Kilpi","desc":"Founding member of Helsinki Institute","full_desc":"Esko Kilpi is a founding member of the Helsinki Institute. Esko’s research and work focus on the arts and sciences of complex interaction, digital work and change as a creative process. Esko is a Taos Institute Associate and a faculty member at the Adianta School for Leadership and Innovation in New Delhi. He is also a founding member of the Entovation Group in the United States.\nEsko suggests that purposeful action and creativity are activities of interdependent people. Much of the communicative activities of people in organizations take the form of repetitive patterns. But because of the nonlinear, iterative nature of human interaction there is always the potential for small differences to be amplified into transformative shifts. Creativity is thus understood as the emerging shifts in the patterns of communicative interaction.\nRecent writings by Esko can be found at http://eskokilpi.blogging.fi","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tDesigning Change\n    \t\t\t\t\t\t\t\tTuesday 17:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Esko_Kilpi_official.jpg","type":"SPEAKER"},{"title":"Johan Lorenzen","desc":"CEO of Holvi","full_desc":"Johan brings more than a decade of experience with high growth internet companies, both from the founder side and investor side. Johan joins Holvi from the venture capital firm Sunstone, to change the future of banking first hand, before that Johan also worked on both the technology and infrastructure side of traditional banking, as well advising and investing in FinTech companies.Holvi is taking banking to the connected age and building a financial hub free from traditional banks. Holvi has successfully built the first pan-European bank replacement for small businesses. Holvi brings banking to the modern age by building an open ecosystem allowing all digital applications and services to connect under one platform.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tDisrupting an antiquated banking industry with user-driven services\n    \t\t\t\t\t\t\t\tTuesday 11:15 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Holvi-CEO-Johan-Lorenzen.jpg","type":"SPEAKER"},{"title":"Fred Davis","desc":"Partner at The Raine Group","full_desc":"Fred Davis joined The Raine Group, a global merchant bank with offices in the US, Europe and China, as a Partner in 2014.  Prior to joining, Fred was one of three Founding Partners of CODE Advisors, where he worked with companies such as Spotify, Supercell, Shazam and Buddy Media.  Before founding CODE in 2010, Fred was the Senior Partner of the leading Entertainment/New Media Law Firm of Davis Shapiro & Lewit.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with Fred Davis\n    \t\t\t\t\t\t\t\tTuesday 17:15 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Fred-Davis.jpg","type":"SPEAKER"},{"title":"Gary Moore","desc":"Partner at MCompany Oy","full_desc":"Gary Moore is Highly experienced and innovative business/sales/development manager with sophisticated sales, customer service and business administration skills. He’s partner at MCompany, which is disrupting means grooming business with Mroom.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tDisrupting men's grooming market\n    \t\t\t\t\t\t\t\tWednesday 11:30 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Gary_cropped.jpg","type":"SPEAKER"},{"title":"Ken Hertz","desc":"Entertainment Attorney and Marketing Strategist","full_desc":"Kenneth Hertz is a Senior Partner in the Los Angeles law firm of Hertz Lichtenstein & Young LLP. Ken and his partners specialize in representing talent and new media companies in the sports and entertainment industries. The firm’s clients include Will and Jada Smith, No Doubt, Gwen Stefani, Idris Elba, The Black Eyed Peas, will.i.am, Sir Ken Robinson, Keith Richards, Herbie Hancock, Jason Mraz, Britney Spears, David Blaine, Shaun White, Jamie Oliver, James Patterson, Lionel Richie, Calvin Harris, Annie Leibovitz and Ariana Grande.Ken is also a principal in memBrain – an entertainment marketing and strategy consulting firm. memBrain’s clients include Hasbro, McDonald’s, Intel, MillerCoors, Logitech, and Keds. Ken is a frequent speaker and commentator on the subjects of entertainment, marketing and convergence; is often quoted in the New York Times, Los Angeles Times, and Wall Street Journal; has appeared on CNBC’s monthly newsmagazine “Business Nation;” has been an instructor at UCLA’s Anderson Graduate School of Management, and an adjunct professor of law at USC.Ken is also the host of TEDxHollywood.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tPutting the Star in Startup - Using celebrities to gain traction strategies and pitfalls\n    \t\t\t\t\t\t\t\tTuesday 17:00 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Ken_Hertz.jpg","type":"SPEAKER"},{"title":"David S. Rose","desc":"Angel investor and author","full_desc":"David S. Rose is one of the world’s leading angel investors, and author of the New York Times best selling book “Angel Investing: The Gust Guide to Making Money & Having Fun Investing in Startups”. He is the founder and Chairman Emeritus of New York Angels, one of the most active business angel networks in the United States; founder and CEO of Gust.com, the world’s largest platform connecting entrepreneurs and early stage investors; Managing Partner of Rose Tech Ventures, with investments in over 100 early stage companies; and Founding Track Chair for Finance, Entrepreneurship and Economics at Singularity University, the Google/NASA sponsored post-graduate program in accelerating technologies.David has been described by Forbes magazine as “New York’s Archangel”, by BusinessWeek magazine as a “world conquering entrepreneur”, and by Red Herring magazine as “patriarch of Silicon Alley”. He has personally founded more than half a dozen companies, served as board chairman of a dozen others, and led investments in companies that have been acquired by Google, Facebook, Amazon, Intel, CBS and other market leaders. He has an undergraduate degree from Yale University, an MBA from Columbia University, and an honorary doctorate in engineering from Stevens Institute of technology.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tEverything You Think You Know...Is Wrong\n    \t\t\t\t\t\t\t\tWednesday 16:45 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/David_S_Rose_cropped.png","type":"SPEAKER"},{"title":"Ananth Krishnan","desc":"Global CTO of Tata Consultancy Services","full_desc":"Ananth Krishnan is the Chief Technology Officer of Tata Consultancy Services, India’s largest and most valued IT company. He is responsible for driving R&D and Innovation in the company and is also the architect of the TCS Co-Innovation Network. Ananth has been a member of the TCS Corporate Leadership since 1999. He has been a Principal Architect and Lead Consultant in the Architecture and Technology Consulting Practice, and earlier the head of the TCS Systems Management and the Systems Software Group.He was named in Computerworld’s Premier 100 IT Leaders for 2007, and in Infoworld’s Top 25 CTOs in the same year. He was named a Distinguished Alumnus of the Indian Institute of Technology, Delhi in 2009, and is a Fellow of the Indian National Academy of Engineering in 2013. He has served on several Advisory Boards of software companies as well as Governing Boards of Industry and academic bodies and Government committees. He has served on the organizing committees of several national and international conferences.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Ananth_Krishnan_better.jpg","type":"SPEAKER"},{"title":"Teemu Arina","desc":"Biohacker at Biohacker's Handbook and CEO of Meetin.gs","full_desc":"","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Teemu_Arina.jpg","type":"SPEAKER"},{"title":"Axelle Lemaire","desc":"French Minister of State for Digital Affairs","full_desc":"xelle Lemaire has been the French Ministry of State for Digital Affairs since April 2014. She calls her now position the “portfolio for imagination”. Born in Canada in 1974, she studied political science at Sciences Po in Paris and law at the Sorbonne and King’s College London. She worked as a researcher and international lawyer before entering politics as a parliamentary assistant in the House of Commons. In 2012, Axelle Lemaire was elected in the French National Assembly to represent the French diaspora living in Northern Europe. As the Secretary of the Law Committee and a member of the European Affairs Committee, her main areas of interest were the digital society and digital economy, the protection of human rights and gender equality, and European politics.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tThe French digital ecosystem\n    \t\t\t\t\t\t\t\tTuesday 14:35 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Axelle_Lemaire.jpg","type":"SPEAKER"},{"title":"Bruce Oreck","desc":"U.S. Ambassador to Finland","full_desc":"Bruce Oreck was sworn in as U.S. Ambassador to Finland on August 12, 2009. Ambassador Oreck has a diverse and encompassing background. Born and raised in New York City, Mr. Oreck also lived in New Orleans, Louisiana for many years and prior to moving to Helsinki, was a long time resident of Boulder, Colorado. Ambassador Oreck has had a lifelong passion for nature and the wilderness. An avid hiker from his youth, Mr. Oreck has camped all over America, throughout Europe and much of East Africa. A mineral collector since he was a boy, Ambassador Oreck has assembled one of the leading collections of fine minerals in the United States and he and his wife are major donors of mineral specimens to museums throughout America.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFiring up the day\n    \t\t\t\t\t\t\t\tWednesday 10:10 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Bruce_Oreck.jpg","type":"SPEAKER"},{"title":"Aydin Senkut","desc":"Founder and Managing Director of Felicis Ventures","full_desc":"Aydin Senkut is the Founder and Managing Director of Felicis Ventures. An original “super-angel” investor, he was named to Forbes’ 2014 Midas List and previously appeared as one of the top 25 tech angels by Businessweek. Aydin is well-known as an early backer of a number of iconic companies including Adyen, Clearslide, Counsyl, Inkling, Practice Fusion, Rovio, and Shopify. 50 Felicis companies such as Climate Corp, Dropcam, Mint, and Meraki, have been acquired by industry leaders such as Google, Facebook, Apple, Microsoft, AT&T, Disney, and Ebay. Today, his focus areas include re-invention of core markets like intelligent SaaS and financial services as well as development of frontier technologies including deep learning and robotics.\nPrior to starting Felicis Ventures, Aydin was a Senior Manager at Google, responsible for strategic partner development and account management in Asia Pacific (including Japan). Aydin joined Google in 1999 as its first Product Manager to launch Google’s first 10 international sites, its first online search licensing products and its first Safe Search. He then became the first International Sales Manager at Google, responsible for world-wide licensing deals.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWhat are the problems next billion dollar startups will solve?\n    \t\t\t\t\t\t\t\tTuesday 15:50 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Aydin_Senkut1.jpg","type":"SPEAKER"},{"title":"Andreas Liffgarden","desc":"Chairman and Founder of Soundtrack your Band","full_desc":"As one of the first non-coders of Spotify, Andreas Liffgarden has seen the company grow from zero to more than 10 million paying subscribers and many millions more using the company´s free service. Anderas, heading up Business Development, was instrumental in creating partnerships between the telecom- and music industry, two industries that used to hate each other but now find themselves in a distribution love affair. The telecom model has since been copied by both Deezer and Beats Music. Now, as the founder and chairman of Soundtrack Your Brand, the Spotify for Business company, Andreas will share his unique perspectives on the tech and music industry and some war stories from the Spotify trenches.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tConnecting brands & fans through Music\n    \t\t\t\t\t\t\t\tTuesday 16:15 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Andreas_cropped.jpg","type":"SPEAKER"},{"title":"Ash Pournouri","desc":"Founder of At Night Management","full_desc":"As the founder of At Night Management and the Paragon group of talent agents, Ash has combined a creative approach to building modern music careers with a hard-nosed, relentless business acumen required in today’s highly volatile entertainment industry. His penchant for creating new paradigms for success stems from an ability to force his vision into reality, and forms the basis of the company’s motto—“we don’t discover artists, we create them.”Based in Stockholm, Sweden, Ash is best known for establishing the career of global superstar DJ and producer Avicii (Tim Bergling), whom he continues to manage along with a growing stable of other artists. He put Avicii on the map by securing a headlining spot at Ultra 2012 a year before Avicii’s following warranted the placement, based on the vision (now reality) that Avicii would be worth the billing when the time came – and he was right. Ash has since added the acclaimed duo Cazzette to his roster, and is adding artists in genres outside of dance as well. With Avicii, Cazzette, and any future client or endeavor, Ash combines his knowledge of law, lessons learned as a promoter, and the passion of a fan to every element of his business. Using legendary entertainment titan David Geffen as a model, Ash’s vision for the future expands beyond music into new areas of opportunity.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tMusic as the Frontrunner of Change?\n    \t\t\t\t\t\t\t\tTuesday 16:45 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Ash_cropped.png","type":"SPEAKER"},{"title":"Bill Bradford","desc":"Chief Growth Officer of Smul","full_desc":"Smule is connecting the world through music, with apps such as Magic Piano, Sing! Karaoke, Guitar! and AutoRap. As chief growth officer, Bill is responsible for revenue and corporate development.   This is Bill’s second stint in the music tech space.  He was CEO & co-founder of Simplify Media, a popular iPhone music streaming app acquired by Google in 2010 (now Google Play Music).   Bill was also COO & co-founder at Thuuz Sports and held various roles at Adobe, Connectix and Tumbleweed.  Bill enjoys playing Polynesian music with his wife and 4 children and coaching youth rugby.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tA Tale of Two Music Startups\n    \t\t\t\t\t\t\t\tTuesday 16:00 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Bill_Bradford.jpg","type":"SPEAKER"},{"title":"Ari Pulkkinen","desc":"Artist","full_desc":"His work with Angry Birds, Trine -series, Outland, Dead Nation and Resogun have made him the most famous video game music composers in the world. Heard by billions of gamers, he is the Finnish Game Developer of the Year 2011, awarded for the Best PS4 Sound in 2013 by IGN and his Trine 2 Soundtrack won the Best Finnish Game Music Soundtrack in 2014.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTrailblazing Game Music Markets\n    \t\t\t\t\t\t\t\tTuesday 17:50 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Ari_Pulkkinen.jpg","type":"SPEAKER"},{"title":"Frank Meehan","desc":"Co-Founder & Partner at SparkLabs Global Ventures, Partner at SparkLa","full_desc":"Frank is a Co-Founder & Partner at SparkLabs Global Ventures and a Partner at SparkLabs, Asia’s premier accelerator based in Seoul. Frank was selected as part of the 2012 Wired UK Top 100 in tech, and Vanity Fair’s The Next Establishment list 2010. He is currently on the board of Lifesum AB in Sweden.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tSo Spotify changed the game! Now what?\n    \t\t\t\t\t\t\t\tTuesday 15:40 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Frank_Meehan1.jpg","type":"SPEAKER"},{"title":"Nenad Marovac","desc":"Managing Partner of DN Capital","full_desc":"Nenad Marovac has more than 20 years of venture capital and private equity investment experience in the media, telecom and technology sectors. Nenad is the Founder and Managing Partner of DN Capital which is a media and technology growth capital and early stage investor with operations in London, Berlin and Palo Alto.  His investments include Apsmart (Acquired by Thomson Reuters),  Datanomic (Acquired by  Oracle), Endeca (Acquired by Oracle), Eyeka, JacobsRimell (Acquired by Amdocs), Mister Spex, Purple Bricks, Shazam Entertainment, Tbricks, Quandoo, Windeln, OLX (Acquired by Naspers).  Nenad is Chairman and CEO of DN Capital and is Chairman of the EVCA Digital Task Force. Prior to founding DN Capitla, Nenad worked at Advent International, one of the world’s leading global private equity houses, where he was a Partner in the London office.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWhat do I look in a music company?\n    \t\t\t\t\t\t\t\tTuesday 17:40 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Nenad_Marovac.jpg","type":"SPEAKER"},{"title":"Net Jacobsson","desc":"Co-Founder & Partner at SparkLabs Global Ventures","full_desc":"Net Jacobsson is a Co-Founder & Partner at SparkLabs Global Ventures. He is a former Facebook executive, entrepreneur and investor with vast international experience from many pioneering companies.In 2007 Net joined Facebook as the head of International business development with focus on new user acquisitions, new markets and early M&A opportunities. In addition Net was responsible for Facebook’s mobile business and led a number of deals with mobile operators and handset manufacturers. Since 2009 Net has been involved an active advisor to Crowdstar, OpenFeint (sold to GREE for $104M) and King.com and founded his own gaming company PlayHopper. In 2012 Net assumed the role as CEO for Ginger Software, an Israeli company specialized in NLP technology before moving on to become a full time investor.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Strategies for companies to go global\n    \t\t\t\t\t\t\t\tWednesday 17:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Net-Jacobsson.jpg","type":"SPEAKER"},{"title":"Oscar Höglund","desc":"Co-Founder and Chief Executive Officer of Epidemic Sound","full_desc":"Oscar is the co-founder and chief executive officer of Epidemic Sound. A graduate of the The Stockholm School of Economics and The Wharton School, Oscar – who was born and raised in London – began his career as a management consultant with The Boston Consulting Group, working across a wide array of industries.In 2004 Oscar joined Zodiak Television, now called Zodiak Media, where he started 5th Element, one of Zodiak’s fastest growing production companies, and served as a member of the Zodiak management team, responsible for all new media efforts. Oscar also co-founded a couple of smaller media and online related businesses before starting Epidemic Sound in early 2009. Oscar is also a co-founder of United Screens (the largest MCN in Scandinavia) and sits on the Board of Toca Boca.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tOld business, new model\n    \t\t\t\t\t\t\t\tWednesday 15:50 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Oscar_Hoglund_cropped.jpg","type":"SPEAKER"},{"title":"Aape Pohjavirta","desc":"Chief Evangelist and Founder of Funzi","full_desc":"Aape Pohjavirta is the chief evangelist and founder of Funzi a mobile learning and information service for the emerging markets, and an entrepreneurship coach and lecturer in Startup Sauna, Aalto University, DTBi and other institutions. Aape sits on advisory boards of multiple research projects and technology programs.Aape has worked in the mobile industry since 1997 in various management roles and has a solid track record of international business, product, and technology development including Ympyra, Exomi Ltd., C&M Capital, Sofi Securities, Vineyard Ltd., Brossco Systems, and People Group.Aape is an Apple Achiever and an international patent inventor.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFunzi - Delivering the skills to build your dreams using mobile\n    \t\t\t\t\t\t\t\tWednesday 15:15 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Aape_Pohjavirta.jpg","type":"SPEAKER"},{"title":"Jason Ball","desc":"Director at Qualcomm Ventures","full_desc":"Jason Ball is a Director at Qualcomm Ventures Europe and is based in London. He currently serves as a board member or observer for Bitbar, Blippar, Cambridge Temperature Concepts, Grand Cru, Peak, Videoplaza, Wonder PL and Wrapp. Jason has also led Qualcomm Ventures investments in Arteris (acquired by Qualcomm) and We7 (acquired by Tesco).Jason has 10 years experience working with internet and mobile software start-ups. Prior to joining Qualcomm, he was the Investment Director at London Seed Capital, a seed and early stage venture capital fund, where he focused on material science and internet technology investments.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Jason_Ball.jpg","type":"SPEAKER"},{"title":"Lucian Schönefelder","desc":"Director at KKR","full_desc":"Lucian Schönefelder joined KKR in 2007 and is a Director on the Private Equity team. He is focused on investments in the European media & technology sector with a particular focus on digital media. Mr. Schönefelder has been involved with KKR’s investments in Scout24 Switzerland, BMG Rights Management, Fotolia, and Duales System Deutschland. He also spent one year with KKR Capstone where he worked on various assignments within ProSiebenSat.1. Before joining KKR, Mr. Schönefelder worked in the  mergers and acquisitions department of JP Morgan in London. He holds a Master of Science in Business Administration as well as a Ph.D., summa cum laude, from the University of St. Gallen in Switzerland.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tInvestor Talk\n    \t\t\t\t\t\t\t\tWednesday 14:35 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Lucian_Schonefelder.jpg","type":"SPEAKER"},{"title":"Dmitry Chikhachev","desc":"Co-Founder and Managing Partner of Runa Capital","full_desc":"Dmitry Chikhachev is co-founder and managing partner at Runa Capital venture fund.\nDmitry is also the chairman of board at «Phystech» IT-cluster, a large infrastructural project at MIPT – one of Europes’s leading tech universities that trains students in various fields of modern science and technology. Dmitry holds an MS degree in Applied Mathematics and Physics from the MIPT. Dmitry’s investment interests span complex software, mobile, virtualization and could computing. He led deal execution for NGINX, Jelastic, LinguaLeo, Ecwid, Cellrox and other Runa Capital companies as well as latest fund’s exits. Dmitry is a ‘hands on’ investor and helps portfolio companies with fundraising, recruitment, strategy and technology. In summer 2014 Dmitry and partners launched $200M Runa Capital Fund II looking to invest the best tech-companies across the Globe. Twitter: @DChikhachev","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside chat with Arkady Dvorkovich, Viktor Vekselberg, Dmitry Chikhachev, Alexander Galitsky and Pekka Viljakainen - Special session: Making money out of Russia\n    \t\t\t\t\t\t\t\tTuesday 12:30 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Dmitry_Chikhachev_cropped.jpg","type":"SPEAKER"},{"title":"Harri Hursti","desc":"A Finnish Independent Security Researcher","full_desc":"Harri Hursti is a Finnish Independent Security Researcher.  He is well known for participating in the various election machine security studies in the USA and around the world. The memory card hack demonstrated in Leon County is popularly known as “the Hursti Hack”. This hack was part of a series of four voting machine tests organized by the nonprofit election watchdog group Black Box Voting in collaboration with the producers of the HBO documentary, Hacking Democracy. Among other studies, he participated in the EVEREST study commissioned by the Secretary of State Ohio, and the New Jersey Superior Court-ordered study of certain voting machines with the Princeton University team. His work has won numerous distinctions, including Electronic Frontier Foundation Pioneer Award.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCybersecurity hour: Electronic society and security\n    \t\t\t\t\t\t\t\tTuesday 15:25 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Harri_Hursti.jpg","type":"SPEAKER"},{"title":"Owen Garret","desc":"Head of Product at NGINX","full_desc":"Owen leads the product team at Nginx, Inc. NGINX is the open source web server and acceleration software delivers traffic for over 40% of the world’s busiest websites and has built an enviable reputation for performance since its first release 10 years ago. Nginx, Inc. is the commercial company formed around the NGINX product, with a mission to build on open source success and create complementary products and services. Prior to NGINX, Owen spent 14 years as a software engineer and lead product manager at Zeus Technology in the UK, developing software load balancing and application delivery technology, helping to guide a successful sale to Riverbed.\n“What keeps me up at night? Trying to find the right balance between supporting and empowering our open source user base, without alienating them as we deliver commercial products and services based on the open source NGINX products they love”, says Owen.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tOpen source in business use\n    \t\t\t\t\t\t\t\tTuesday 11:55 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Owen-Garrett_NGINX.jpg","type":"SPEAKER"},{"title":"Stepan Ilyin","desc":"Product director and COO of Wallarm","full_desc":"Stepan is well-known as former editor-in-chief of a widely acclaimed monthly publication for information security professionals. He is author of more than 500 publications covering modern technologies and information security. In 2013 Stepan became Product Director and COO at Wallarm, the web security solution that protects online businesses from application-level hacker attacks. Stepan has a degree in Computer Science from the Bauman Moscow State Technical University and holds a postgraduate degree in Business Administration.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWhy your web-service will be hacked someday and how you can try to avoid it\n    \t\t\t\t\t\t\t\tTuesday 12:30 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/stepan_ilyin_WALLARM.jpg","type":"SPEAKER"},{"title":"Richard Stallman","desc":"Founder of Free Software Foundation","full_desc":"Richard Stallman campaigns for freedom in the use of computers. We users deserve control over our computing.  To have that, we need to do our computing in our own computers (not someone else’s server) with free/libre (user-controlled) software.Freedom includes privacy; for privacy we must hold our own data, not confide it to others except after encrypting it ourselves or when we want to publish it.  To abolish massive surveillance we must redesign digital systems not to amass dossiers about people in general.Richard Stallman is probably the only person at Slush who has no mobile phone.  The phone network tracks and records phones’ locations; for Stallman, Orwellian surveillance is too big a sacrifice for mere convenience.  The nonfree systems and apps of “smart”phones exact an even higher cost in freedom.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFree Software and Education: The Road Ahead\n    \t\t\t\t\t\t\t\tWednesday 17:30 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Richard-Stallman_1.jpg","type":"SPEAKER"},{"title":"Antti Vilpponen","desc":"Chief Executive Officer of UpCloud","full_desc":"Antti Vilpponen is the Chief Executive Officer of UpCloud, an innovative and fast growing cloud hosting company for the business critical web. UpCloud was founded in September 2011 by Joel Pihlajamaa. While the cloud hosting market is dominated by large US based companies, UpCloud has managed to create the world’s fastest storage backend that it is demonstrating in Slush. Before joining UpCloud, Antti was also one of the original founders of ArcticStartup, the largest media company in the Nordics and Baltics covering startups and innovative technologies.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCompeting with AWS, Microsoft and Google - and winning\n    \t\t\t\t\t\t\t\tTuesday 11:25 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Antti_Vilpponen.jpg","type":"SPEAKER"},{"title":"Rick Pizzoli","desc":"Managing Director of Sales Force Europ","full_desc":"Rick Pizzoli, Managing Director of Sales Force Europe (SFE), founded the company in 2003. Rick has grown SFE to successfully introduce over 100 Tech Companies to the EMEA and Latin American markets managing a team of 60 Partners. SFE helps high-tech companies launch, develop and expand their business internationally.\nPrior to starting SFE, Rick launched Maple Optical Systems in Europe, a $100M funded Silicon Valley startup. Previous to Maple Optical, Rick ran Nortel’s European Business Development, which resulted in over $75M of incremental business for the company. During his tenure at Nortel, Rick launched a startup line of business in London achieving $70 million in revenue during the first two years. Rick consistently ranked in the top 5% of sales during a five-year period while at Nortel San Francisco.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tScaling b2b software sales in EMEA markets\n    \t\t\t\t\t\t\t\tTuesday 10:25 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Rick_Pizzoli.png","type":"SPEAKER"},{"title":"Marc Dillon","desc":"Co-founder and COO of Jolla Ltd. ","full_desc":"Marc Dillon is the co-founder and COO of Jolla Ltd., the smartphone company from Finland. The sales start of the Jolla smartphone was announced at Slush 2013, and since then Jolla has expanded sales to cover the whole Europe, Hong Kong and India. At Jolla Marc’s role is to oversee the company’s most important asset, the independent Sailfish OS mobile operating system. Marc has 22 years of experience in wireless communication, and he is global speaker and thought leader in mobile technology. Prior to Jolla, Marc worked for Nokia in 2001-2012. He is also a guitarist & singer, motorcyclist, and enthusiastic in mechanics & electronics.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tJolla  - The Impossible Story Continues\n    \t\t\t\t\t\t\t\tWednesday 10:35 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Marc_Dillon.jpg","type":"SPEAKER"},{"title":"Jorn Lyseggen","desc":"Founder of Meltwater","full_desc":"Jorn Lyseggen founded Meltwater in 2001 with only $15,000.  Meltwater has since grown into the  Meltwater we know today as a global leader in online intelligence. As CEO, Jorn leads the expansion of Meltwater with new ventures in the Software as a Service (SaaS) market. Jorn also founded the Meltwater Entrepreneurial School of Technology (MEST), a non-profit designed to provide training and mentoring to young African entrepreneurs aspiring to launch new, Ghana-based software companies. Jørn is a Norwegian entrepreneur and patent holder with four start-ups, and he has two trade sales and one IPO to his credit. The most rewarding aspect of Jorn’s career continues to be helping young people develop into confident and capable managers, which makes him proud of Meltwater and gives him continued motivation.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tThe Story of Meltwater\n    \t\t\t\t\t\t\t\tTuesday 10:05 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Jorn.jpg","type":"SPEAKER"},{"title":"Jacob De Geer","desc":"Founder and CEO of iZettle","full_desc":"Jacob De Geer is Founder and CEO of iZettle. iZettle is payments made easy. The social payments company’s services are always secure, fantastically fast to set up, and super simple to use. iZettle lets anyone selling anything face to face use smartphones and tablets to accept credit card payments and manage their business – and for a fraction of the cost of traditional systems. Founded in 2010, with headquarters in Stockholm, iZettle is now available in the U.K, Spain, Germany, Sweden, Denmark, Norway, Finland, Mexico and Brazil, and coming soon to more countries.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Jacob_de_Geer_new1.png","type":"SPEAKER"},{"title":"Alireza Yaghoubi ","desc":"CTO of AirGo Design ","full_desc":"Alireza Yaghoubi is an award-winning designer and entrepreneur who has gained international recognition for designing AirGo, an ergonomic passenger environment that has been described as “the future of airlines seating” by mass media in over 15 languages. Alireza is the co-founder and Chief Technology Officer of the Singapore-based startup, AirGo Design which is currently developing new seating technologies for a more comfortable travel experience with smaller carbon footprint. The company is the first to advocate a major transition in the travel industry since the 1960’s.\nAlireza is also a multidisciplinary scientist at the Center for High Impact Research in University of Malaya. At the age of 24, he is one of the youngest scientists in the world whose works have appeared on the front cover of many prestigious journals such as those of Royal Society. His broad scope of research ranges from fundamental studies on synthesis of nanomaterials to more practical applications such as renewable energy and biomedical implants. Alireza is an engineer by training and has graduated as the Frederic Barnes Waldron student of mechanical engineering.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Alireza.jpg","type":"SPEAKER"},{"title":"Arndt Kwiatkowski","desc":"Founder and CEO of Bettermarks","full_desc":"Arndt Kwiatkowski is founder and CEO of bettermarks GmbH. After studying Business Administration in Münster, Kwiatkowski started his career in Marketing / Corporate Strategy at computer manufacturer Siemens-Nixdorf. He then joined the consultancy company Perot Systems as Business Development Director. In 1997 he founded ImmobilienScout24, which he led as CEO until 2008. Immobi- lienScout changed the face of the real estate market in Germany and became THE market place for properties to buy or rent in any category. The company was sold to Deutsche Telekom in 2007 at a valuation of € 540 million. In 2008, together with Marianne Voigt and Christophe Spéroni, Arndt founded bet- termarks, an innovative online learning system for maths. Bettermarks enables every student to learn maths – regardless of the quality of the school system or parental/financial support. 80 mathematicians, teachers and software engineers develop bettermarks. bettermarks was awarded the “GIGA-Maus” (2010; best online learning system > 10 years), the “digita” (2011 and 2012; best private learning offer > 10 years) and the “Comenius EduMedia Medal” (2013; best “Didactic Multimedia Product”).","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBettermarks\n    \t\t\t\t\t\t\t\tWednesday 14:55 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Arndt-Kwiatkowski.jpg","type":"SPEAKER"},{"title":"Benjamin Vedrenne-Cloquet","desc":"Co-Founder of EdTech Europe","full_desc":"Previously EMEA Vice President of Strategy, Business Development and New Ventures at Turner (Time Warner), Benjamin was heading the pan European growth and diversification initiatives including M&A, launches of new channels, and investing in digital media, gaming and content companies.He previously held various managerial and corporate development roles at Modern Times Group (TV, Digital Media, E-commerce), Lagardere Media (Print, TV, Radio), and Omnicom BBDO (Advertising & Markteting Services), involving particularly acquisitions, roll out and development of entrepreneurial media businesses across Europe and Eastern Europe. Benjamin is the Founder of Archipelago, an investment club focusing on media early stage companies. He is an MBA graduate from Babson and holds business degrees from ESCP Europe and University of Texas at Austin.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tEdtech Europe winners\n    \t\t\t\t\t\t\t\tWednesday 14:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Benjamin_Vedrenne-Cloquet.jpg","type":"SPEAKER"},{"title":"Bill Gei","desc":"Co-founder and CEO of Meta Watch Ltd.","full_desc":"Bill Geiser is the co-founder and CEO of Meta Watch Ltd., a smartwatch technology and services company with offices in Espoo, Finland & Dallas, Texas.\nMeta Watch was formed in August of 2011 via a spinoff from the Fossil Group Inc (NASDAQ: FOSL), where Geiser had served as the VP of Watch Technology since 2004. Geiser and the Meta Watch team bring over a decade of smartwatch development experience having developed smartwatches for Fossil, Microsoft, Palm, Sony Ericsson, adidas and others.\nGeiser first began focusing on wrist-based technology in 1994 when he founded Strokz Digital Sports, a company specializing in sensor-based watches for competitive swimmers and triathletes. These products were marketed globally under the Speedo brand.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Bill_Geiser.jpg","type":"SPEAKER"},{"title":"Carlos Silv","desc":"COO, President and co-founder of Seedrs","full_desc":"Carlos is the COO, President and co-founder of Seedrs, Europe’s most-active online platform for discovering and investing in great startups. He is an IT development and security expert with nearly ten years of industry experience, most of them in a leading role. Most recently he served as Head of New Product Development at Sysvalue, an innovative information systems security consulting firm based in Lisbon, and he has also worked as an information security consultant to a range of leading European financial institutions.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Carlos_cropped.jpg","type":"SPEAKER"},{"title":"Eetu Kirsi","desc":"Co-founder of Plan Brothers","full_desc":"Eetu Kirsi is a co-founder of Plan Brothers, the company that revolutionized security into cloud-based feng shui. Plan Brothers gained over 10.000 paying customers in under two years with its emergency planning service. Eetu believes that best outcomes for a start-up are reached with combination of agile action and constant reflection.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tHow we scaled our service profitably to 10,000 paying customers in two years without funding?\n    \t\t\t\t\t\t\t\tTuesday 10:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Eetu_Kirsi_cropped.jpg","type":"SPEAKER"},{"title":"Harri Ketamo","desc":"Founder at SkillPixels","full_desc":"Harri Ketamo, Ph.D. is a founder at SkillPixels Ltd. He is also a Senior Fellow at University of Turku, Finland and Adjunct Professor at Tampere University of Technology, Finland. During his academic career, Ketamo has specialized in Cognitive Psychology of Learning, Complex Adaptive Systems, Semantic Computing and Game AIs.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tScience of Learning and Games\n    \t\t\t\t\t\t\t\tWednesday 15:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Harri_Ketamo.jpg","type":"SPEAKER"},{"title":"Henrik Dahl","desc":"CEO of Eniram","full_desc":"In addition to leading Eniram, Henrik is in charge of building sales and managing key customer relationships. He has an entrepreneurial background, peppered by business experience. His previous experience includes managing a software startup and working in the field of business analytics.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCleaner Shipping with Data Analytics\n    \t\t\t\t\t\t\t\tTuesday 13:23 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Henrik_Dahl.jpg","type":"SPEAKER"},{"title":"Mike LaVigne","desc":"Co-Founder and Head of Product at Clue","full_desc":"Mike LaVigne is a co-founder and Head of Product at Clue, a digital female health company based in Berlin whose Clue app is acclaimed as the most streamlined, user-friendly menstrual cycle tracking app available. Formerly a Creative Director at Frog Design and Fjord, two of the world’s most renowned design agencies, Mike is an experienced designer, researcher and strategist.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tReproductive Health and Mobile\n    \t\t\t\t\t\t\t\tWednesday 16:30 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Mike_LaVigne.jpg","type":"SPEAKER"},{"title":"Dr. James Wilk","desc":"Founding Member of Helsinki Institute","full_desc":"A highly qualified and accomplished clinician in the psychiatric field, Dr Wilk is a distinguished cybernetician, psychologist and philosopher whose career has been devoted to the study of change. He is the architect of the scientific, analytical methodologies known as “minimalist intervention,” for rapidly filtering the complexity of real-world situations. This rigorous design process pinpoints small, catalytic interventions resolving intractable problems and creating major change successfully and sustainably in ‘impossible’ timeframes. Accordingly, for over 25 years he has served as long-term chief advisor to the CEOs and top management of some of the world’s leading corporations, as well as the leaders of third-sector, governmental and multi-governmental bodies on both sides of the Atlantic. Based in London and Helsinki, he is on the Faculty of Philosophy, University of Oxford, where he has taught and researched for many years, and he is a Fellow of the New York Academy of Medicine where he serves as Senior Advisor to the President.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Dr-James-Wilk-2014-landscape.png","type":"SPEAKER"},{"title":"Jason Geall","desc":"CEO of The Student Room Group","full_desc":"Jason Geall is responsible for leading The Student Room Group, which is the UK’s largest and fastest growing Digital learning community.   The Student Room has nearly 1.5 million community members, driving over 420,000 conversation posts every month and has grown by 609% in the last 4 years. Jason joined The Student Room Group in July 2012 after 10 successful years in the Travel and Technology sector, most recently as Vice President & Chief Marketing Officer at global travel solutions provider GetThere, a Sabre Holdings company. Prior to this, Jason was Head of UK Sales at Eurostar. The International  High speed rail operator.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Jason-Geall.jpg","type":"SPEAKER"},{"title":"Jean-Baptiste Huynh","desc":"Co-founder and CEO of WeWantToKnow","full_desc":"Ex finance guy, ex teacher, Huynh is the creator of the award winning educational game serie DragonBox. His company maintains the audacious goal of delivering K-12 mathematics big ideas to any child in 30 hours of gameplay. Huynh is also the co-creator with the Center for Game Science in Washington of the algebra challenge event concept. WeWantToKnow ran in January 2014 the biggest learning gaming competition in Norway with some 40,000 kids learning basic algebra over a week with stunning results. With WeWantToKnow, Huynh combines his passion for learning, entrepreneurship and social impact.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTeaching a middle-school curriculum to kids in 42 minutes\n    \t\t\t\t\t\t\t\tWednesday 15:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Jean-Baptiste.png","type":"SPEAKER"},{"title":"Jo Bertram","desc":"CEO of Uber UK & Nordics","full_desc":"Jo Bertram leads Uber’s UK, Ireland and Nordic operations. Jo joined Uber with over 8 years of management consultancy experience, having worked for both McKinsey and Accenture. Her project focus spans the telecommunications, transportation and FMCG sectors among others, with specific expertise in regulatory strategy and growth strategy, alongside more operational experience. Though born and bred in the UK, her work has taken Jo to the US, Australia, Switzerland, Ethiopia, UAE, and most recently, South Africa. Jo also holds an MBA from INSEAD. Outside of work, Jo holds a private pilot’s licence, is a keen skier and loves to travel off the beaten track, with Antarctica being the most recent highlight.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tUber's ision for future\n    \t\t\t\t\t\t\t\tWednesday 17:25 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Jo_Bertram_cropped.jpg","type":"SPEAKER"},{"title":"Inka Mero","desc":"Chairwoman IndoorAtlas & KoppiCatch","full_desc":"Inka Mero is the Chairwoman and one of the first investors of IndoorAtlas, the Oulu and Silicon Valley -based company providing a revolutionary and infrastructure free magnetic indoor positioning service. On September 2014 IndoorAtlas announced a $10 Series A investment from Baidu, China’s biggest search and world’s largest map company. As a founder and chairwoman of KoppiCatch seed investor and accelerator company, Inka is deeply passionate about building growth companies, which have their roots in disruptive technology and business innovation. During her career Inka as an pioneer female entrepreneur and investor has founded and/or invested in 30+ growth companies in industries as diverse as telecom, internet, e-commerce, media, media tech, mobile and telecom. She is an active member of the Nordic and Baltic startup scene, the ex -Head Coach of Startup Sauna accelerator, Board Member of Nokian Tyres Plc and a Board member the non-profit organisation Startup Sauna Foundation.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tIndoorAtlas - driving platform strategy. Story of Baidu investing to a tech startup from Oulu.\n    \t\t\t\t\t\t\t\tWednesday 14:10 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Inka_Mero.jpg","type":"SPEAKER"},{"title":"Johnny Warström","desc":"CEO and Co-founder of Mentimeter","full_desc":"Johnny has had a successful career within Telecom and IoT. He started as CEO Trainee at Telenor Group within the IoT dimension. He headed the group that took IoT to Thailand, Malaysia and Hungary. He was named one of Internetworld’s top Entrepreneurs and Veckans Affärer top talent in 2013.Mentimeter’s mission is to put an end to boring and inefficient meetings. Our customer base consists of global brands like Accenture, Imperial College and Microsoft. With users in 100 countries and customers in 28, over 80% of our users claim that Mentimeter makes their work more efficient. We’re at Slush to address gender inequality in tech and start-ups. Johnny will talk about how a data driven work culture can change everything.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tData driven culture - how to deal with gender equality in start-ups and tech\n    \t\t\t\t\t\t\t\tWednesday 12:10 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Johnny_Wahrstrom.jpg","type":"SPEAKER"},{"title":"Jon Marshall","desc":"Design Director and Co-founder of MAP","full_desc":"Jon Marshall is the Design Director at MAP, a London-based creative consultancy that specialises in strategy-led industrial design. MAP’s clients include some of the most innovative and well known companies in the world such as Virgin Atlantic, Google and Panasonic alongside ambitious growth companies such as Kano and Sabi.Jon graduated from the Royal College of Art in 1996 with a Masters degree in Industrial Design and then worked at leading design firms Pentagram and Ross Lovegrove. He joined Barber Osgerby as Studio Director in 2003 and developed some of the studio’s most iconic furniture and products such as the De La Warr Pavilion Chair, Tab Lamp and the 2012 Olympic Torch before co-founding MAP with Barber and Osgerby in 2012.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tDesigners who make things\n    \t\t\t\t\t\t\t\tTuesday 17:25 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Jon_Marshall.jpg","type":"SPEAKER"},{"title":"Kalle Määttä","desc":"CEO and Chief Wastevangelist of Pure Waste Textiles","full_desc":"Kalle Määttä is the CEO of Pure Waste Textiles, a company that is the world-leading provider of 100% recycled textiles. Kalle has a long-standing entrepreneurial career on the digital side, until last year changing his focus from bits to atoms. Kalle believes that the current way the textile industry operates today needs to change. The fashion industry needs to wake up. Pure Waste Textiles was born out of a desire to create this change, and halt the huge amount of fabric wasted in the production of fashion accessories. Where others see waste, Kalle and Pure Waste see treasures.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWhere others see waste, we see treasures\n    \t\t\t\t\t\t\t\tTuesday 14:03 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Kalle_Maatta.jpg","type":"SPEAKER"},{"title":"Joy Marcus","desc":"CEO of Bloglovin","full_desc":"Joy Marcus is CEO of Bloglovin, a rapidly growing global destination for young women interested in fashion, with over 30 million monthly users. She is also a Venture Partner at Gotham Ventures (a Draper Fisher Jurvetson network fund) and the James Wei Professor of Entrepreneurship at Princeton University, her alma mater. Most recently, Joy was Managing Director of the US for video site Dailymotion, acquired by Orange (French Telecom) for $180M in 2011. She is a veteran of the NYC tech and media communities having held senior positions at Time Warner (AOL) and MTV Networks. She has been recognized as a Women of Power and Influence by the National Organization for Women, one of the “Digital Power 50” by The Hollywood Reporter, as a “Top 50 Most Powerful Working Mother” by WorkingMom.com.and most recently as a “Woman to Watch” by Crain’s New York.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tBloglovin' : Inspiration 3.0\n    \t\t\t\t\t\t\t\tTuesday 14:20 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Joy_Marcus.jpg","type":"SPEAKER"},{"title":"Ilya Sachkov","desc":"Founder and CEO at Group IB","full_desc":"Ilya Sachkov, CISM, the founder and head of Group-IB, the leading Russian company, specializing in the investigation of computer crime, information security breaches, and computer forensics. The author of a technology of investigation of circumstances of DDoS attacks. The member of the International Information Systems Forensics Association (IISFA), the Association of Certified Fraud Examiners (ACFE), the Honeynet Project, the Russian Information Systems Security Professional Association (RISSPA) and the Committee against Cyber-Crime at the Russian Association of Electronic Communication (RAEC).","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tCybersecurity hour: DDoS and malware threat as well as Russian cybercrime specifics\n    \t\t\t\t\t\t\t\tTuesday 15:40 at \n    \t\t\t\t\t\t\t\tSilver Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Ilya_Sachkov.jpg","type":"SPEAKER"},{"title":"Martin Willers","desc":"CEO and Co-founder of PEOPLE PEOPLE and PEOPLE products","full_desc":"Martins is an entrepreneur and a design thinker. He started his first business when he was 16 years old and has multiple degrees within business and design. Since he co-founded design and innovation studio People People 4 years ago he has been overseeing design projects for big brands including IKEA, Miele, Samsung and SAAB, as well as for disruptive startups such as Flic Shortcut Button, Narrative Life-logging Camera and Chui the Intelligent Doorbell. Martins passion lies with understanding the interplay of people, design & sustainability, and he has a long term vision of changing the entire consumer product industry for the better. Martin is recently leading the way towards this vision with People People’s own product venture People Products.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTest desirability before going to production\n    \t\t\t\t\t\t\t\tTuesday 16:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Martin_Willers.jpg","type":"SPEAKER"},{"title":"Olli Sinerma","desc":"Co-founder & Project Lead at Mindfield Games","full_desc":"In 2014 Sinerma co-founded Mindfield Games, a studio focused on virtual reality and developing entertainment for devices of tomorrow. Sinerma has released over 20 games for different platforms, pioneered games education in Finland at the University of Helsinki and previously served as a producer of Everyplay, a social network for mobile games that was acquired by Unity Technologies in 2014.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\t2015: a virtual odyssey - Developing games for VR\n    \t\t\t\t\t\t\t\tTuesday 10:25 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Olli_cropped.jpg","type":"SPEAKER"},{"title":"Matias Myllyrinne","desc":"CEO of Remedy Entertainment","full_desc":"As one of the key figures behind the company’s success, Matias is responsible for leading the studio. Since joining the company in 1999, he has helped build Remedy into one of the world’s leading independent game developers.Remedy Entertainment Ltd. is a privately held developer of state-of-the-art action games, game franchises and cutting edge 3D game technology, based in Espoo, Finland. Highly acclaimed games include Death Rally, Max Payne, Alan Wake and Agents of Storm.Remedy is currently working on Quantum Break, exclusively for Xbox One, as well as unannounced iOS projects.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWe shall not cease from exploration. Remedy and firsts\n    \t\t\t\t\t\t\t\tTuesday 11:05 at \n    \t\t\t\t\t\t\t\tBlack Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Matias_Myllyrinne.jpg","type":"SPEAKER"},{"title":"Mika Välital","desc":"Senior Specialist on ICT for Development and Innovation for Plan International Finland","full_desc":"Mika Välitalo works as a Senior Specialist on ICT for Development and Innovation for Plan International Finland. Over the past nine years he has produced several guidebooks on the use of technology in development programs and supported in designing, implementing and planning ICT enhanced projects, primarily in Africa. Mika has studied ICT in the University of Aalto, International Development in the University of Helsinki and has a degree from the Polytechnic Metropolia on Social Work. Over the past five years Mika has worked with Plan’s Corporate Partnerships unit and managed the Nokia funded program portfolio. He writes Global pICTure blog and tweets at @vatamik.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Mika_Valitalo.jpg","type":"SPEAKER"},{"title":"Rolf Assev","desc":"Partner at StarupLab, ex EVP of Opera Software","full_desc":"Rolf Assev is an independent investor and entrepreneur with focus on education and new technology. A key new start-up is WeWantToKnow – the company behind the award winning math game, DragonBox. Rolf worked for 12 years in Opera Software as Executive Vice President Sales and Marketing, Chief Commercial Officer and Chief Strategy on an exciting journey building the company from 12 to 750 people with more than 200 million active users. He started his post-secondary education at the Royal Norwegian Naval Academy, before receiving his Master of Science degree from the Norwegian School of Business Administration in 1988. Rolf’s work experience includes the Norwegian Trade Council in Stockholm, the marketing department of the Lillehammer Olympic Organizing Committee, senior consultant for the Nordic PR agency Geelmuyden.Kiese and managing director for Spaceworld AS.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tOpera Browser - Why Rebels Win\n    \t\t\t\t\t\t\t\tTuesday 11:40 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Assev-Rolf.jpg","type":"SPEAKER"},{"title":"Sabine Schumann","desc":"Managing Director of PAU Education","full_desc":"Sabine Schumann is the Managing Director of PAU Education and board member of the European Learning Industry Group. PAU Education designs and implements strategies and projects that address essential social challenges by relying on innovative participatory methods and tools. One of the core areas is boosting social innovation and education entrepreneurship.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Sabine_cropped.jpg","type":"SPEAKER"},{"title":"Sanuy Karani","desc":"Founder of FundingBox","full_desc":"Sanyu Karani has been raising public funding for innovation since the `90s. Mainly for corporations but also for governments and more recently for Public Private Partnerships. After winning the EC sponsored OpenIDEO crowdsourcing contest to boost webentrepreneurship, Sanyu  also started to help raise funding for startups. Sanyu is the Founder of FundingBox, the first and largest public funding platform for startups and accelerators that is currently distributing 12 million euros in grants of 100-150 k euros per startup.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Sanuy_Karani.jpg","type":"SPEAKER"},{"title":"Mikko Järvenpää","desc":"COO of Infogr.am","full_desc":"Mikko Järvenpää is the COO of Infogr.am and has been an advisor with the company since the start. Earlier he was a Product Marketing Manager with Google in London, co-founded the human-centric consulting company Gemic in Helsinki, served as the Chief Marketing Geek for HackFwd, and co-founded the video startup Vuact. Mikko’s passion for responsibility and ethics in design and business has been shaped over the years of working in the industry and combined with his post-graduate degree in Philosophy of Social Sciences from London School of Economics.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tAlways Design Responsibly\n    \t\t\t\t\t\t\t\tTuesday 16:55 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Mikko_Jarvenpaa.jpg","type":"SPEAKER"},{"title":"Stefan Heeke","desc":"Executive Director at SumAll.org","full_desc":"Stefan Heeke is Executive Director at SumAll.org, a technology non-profit organization dedicated to advancing social innovation through data. Having studied in Paris, London, Madrid and Germany, he holds an MBA from the French ‘Grande Ecole de Commerce’ ESCP-EAP and a BS in Economics from the University of Münster. Stefan also holds an airline pilot license and is an active flight instructor.Throughout his career Stefan worked in various international agencies, digital consultancies and corporations, including BBDO, McCann Erickson, Pixelpark, Bertelsmann and Siemens before joining SumAll.org. Current SumAll.org projects include data-driven homelessness prevention in NYC and analytics related to causes such as human trafficking, drug abuse, education and war-crimes in Syria.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tWhy Startups are the Future of Social Innovation\n    \t\t\t\t\t\t\t\tWednesday 12:20 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/stefan-heeke.jpg","type":"SPEAKER"},{"title":"Stina Liland Nysæther","desc":"Co-Founder of Startup Norway","full_desc":" Stina Liland Nysæther is co-founder of Startup Norway. Startup Norway is experts on the norwegian startup ecosystem. Stina’s vision is a Norwegian startup ecosystem that works together as a community, inspires a new generation of Norwegian entrepreneurs and make sure startups have the right resources at hand. Stina is also heavily involved in Startup Weekend, where she as an Global Facilitator visits other startup communities in Europe.In a small country with a lot of extremes, Startup Norway is working to get it’s community noticed on the international startup scene. Keep an eye out for the invite only Startup Extreme festival taking place june 2015, in Stina’s hometown Voss.","speaks":"","img":"http://www.slush.org/wp-content/uploads/2014/08/Stina_cropped.jpg","type":"SPEAKER"},{"title":"Taavi Madiberk","desc":"Co-Founder and Chief Executive Officer at Skeleton Technologies","full_desc":"Mr. Madiberk is the Co-Founder and Chief Executive Officer at Skeleton Technologies. His business development, sales and marketing and company management skills have been instrumental in setting-up and driving growth. He has been the driving force for excellent customer traction, (the company counts as customers European Space Agency and several Tier 1 automotives), business strategy (leveraging the advantage in materials technology to energy storage cells and modules), product development and fundraising from venture capital, private equity and public sources in German, Estonian and EU level.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tStorage batteries for renevable energy\n    \t\t\t\t\t\t\t\tTuesday 13:33 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Taavi_Madiberk.png","type":"SPEAKER"},{"title":"Kaisa Salakka","desc":"Director of Business Analytics of Omniata","full_desc":"Kaisa is the Director of Business Analytics of Omniata, a unified data and engagement platform. Kaisa has over 10 years experience in developing and selling products used in advanced big data analytics. Omniata is her first experience in games industry but analytics is the same no matter if it’s done for retail, media, telecom or gaming. Prior to Omniata Kaisa headed data science team in Xtract, Finnish start-up company focusing on predictive analytics and automated machine learning. The company was acquired by Comptel in 2012","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tPersonalizing UX for enterprise software using today's data tools\n    \t\t\t\t\t\t\t\tTuesday 12:20 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Kaisa_Salakka_small.jpg","type":"SPEAKER"},{"title":"Teemu Sihvola","desc":"Co-founder and CEO of Ajelo","full_desc":"Teemu is a co-founder and CEO of Ajelo, a technology company having a super-scalable solution for shared-ride services. Teemu has wide range of experience in on-demand transportation as a consultant, researcher and now as a startup entrepreneur. Teemu spends his rare spare time with his wife and their two sons, if not watching a game of Arsenal FC which he enthusiastic supports.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Mobility as a Service – the future of transportation\n    \t\t\t\t\t\t\t\tWednesday 14:30 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Teemu_Sihvola.jpg","type":"SPEAKER"},{"title":"Ville Hyvönen","desc":"Founder and CEO of Helicam Services Oy ","full_desc":"Born year 1976 in Kajaani, Northern Finland to a theatre director mother and musician father both working in Kajaani City Theatre. Refused to go to daycare so spent childhood lurking around the hallways of theatre. Involced in the scandinavian 8-bit and 16-bit computer (C-64, Amiga) demo underground “scene” since 12 years old. Took part in 1st ever Assembly – event 1992, also organised few such events. Formed demogroup CNCD, that won many of the biggest demo- competitions in scandic. http://www.assembly.org Started my first own .ltd company at the age of 18. I feel most confortable in the interfaces.","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tTheatre, Drones and Failure\n    \t\t\t\t\t\t\t\tTuesday 17:50 at \n    \t\t\t\t\t\t\t\tGreen Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Ville_Hyvonen.jpg","type":"SPEAKER"},{"title":"Carl-Magnus Norden","desc":"CEO Crowdcube North AB","full_desc":"Carl-Magnus is a Serial Entrepreneur and Angel investor with experience from Real estate development (Benelux and Sweden), Private Equity (investments in Central and Eastern Europe), Restructuring of Industrial production companies (Czech Republic, textile and hat manufacturing), mobile telecom (MVNO) Poland and “voice-on-the-web” (Pan-European, Sweden, Switzerland). Carl-Magnus also holds a MBA from INSEAD, France.Crowdcube, founded in the UK in 2011, is today the world’s prime Equity Crowdfunding platform. Through Crowdcube North, Carl-Magnus brings Crowdcube’s technology, track-record and expertise to the Nordic and Russian markets.\nDedicated to helping entrepreneurs raise finance to start or grow their business, Crowdcube is the world’s first crowdfunding website that allows anyone to invest and get real equity in the companies they fund.\nThrough Crowdcube the entrepreneurs reaches more than 100 000 people, in several markets, that can add business relations, contacts, experience and money to the company.\nMany shareholders – good for the Company – good for the Entrepreneur – good for the Investors!","speaks":"    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t\t\tFireside: Crowdfunding platforms\n    \t\t\t\t\t\t\t\tWednesday 16:35 at \n    \t\t\t\t\t\t\t\tYellow Stage    \t\t\t\t\t\t\t\n    \t\t\t\t\t\t","img":"http://www.slush.org/wp-content/uploads/2014/08/Carl-Magnus_Norden.jpg","type":"SPEAKER"}]